micropython/micropython/lib/stm32n6/CMSIS/STM32N6xx/Include/stm32n655xx.h
/**
  * @brief USB_OTG_IN_Endpoint-Specific_Register
  */
typedef struct
{
  __IO uint32_t DIEPCTL;             /*!< dev IN Endpoint Control Register,          Address offset: 900h + (ep_num * 20h) + 00h */
  __IO uint32_t Reserved04;          /*!< Reserved,                                  Address offset: 900h + (ep_num * 20h) + 04h */
  __IO uint32_t DIEPINT;             /*!< dev IN Endpoint Itr Register,              Address offset: 900h + (ep_num * 20h) + 08h */
  __IO uint32_t Reserved0C;          /*!< Reserved,                                  Address offset: 900h + (ep_num * 20h) + 0Ch */
  __IO uint32_t DIEPTSIZ;            /*!< IN Endpoint Txfer Size Register,           Address offset: 900h + (ep_num * 20h) + 10h */
  __IO uint32_t DIEPDMA;             /*!< IN Endpoint DMA Address Register,          Address offset: 900h + (ep_num * 20h) + 14h */
  __IO uint32_t DTXFSTS;             /*!< IN Endpoint Tx FIFO Status Register,       Address offset: 900h + (ep_num * 20h) + 18h */
  __IO uint32_t Reserved18;          /*!< Reserved,                                  Address offset: 900h + (ep_num * 20h) + 1Ch */
} USB_OTG_INEndpointTypeDef;

/**
  * @brief USB_OTG_OUT_Endpoint-Specific_Registers
  */
typedef struct
{
  __IO uint32_t DOEPCTL;             /*!< dev OUT Endpoint Control Register,         Address offset: B00h + (ep_num * 20h) + 00h */
  __IO uint32_t Reserved04;          /*!< Reserved,                                  Address offset: B00h + (ep_num * 20h) + 04h */
  __IO uint32_t DOEPINT;             /*!< dev OUT Endpoint Itr Register,             Address offset: B00h + (ep_num * 20h) + 08h */
  __IO uint32_t Reserved0C;          /*!< Reserved,                                  Address offset: B00h + (ep_num * 20h) + 0Ch */
  __IO uint32_t DOEPTSIZ;            /*!< dev OUT Endpoint Txfer Size Register,      Address offset: B00h + (ep_num * 20h) + 10h */
  __IO uint32_t DOEPDMA;             /*!< dev OUT Endpoint DMA Address Register,     Address offset: B00h + (ep_num * 20h) + 14h */
  __IO uint32_t Reserved18[2];       /*!< Reserved,                                  Address offset: B00h + (ep_num * 20h) + 18h */
} USB_OTG_OUTEndpointTypeDef;

/**
  * @brief USB_OTG_Host_Mode_Register_Structures
  */
typedef struct
{
  __IO uint32_t HCFG;                 /*!< Host Configuration Register,              Address offset: 400h */
  __IO uint32_t HFIR;                 /*!< Host Frame Interval Register,             Address offset: 404h */
  __IO uint32_t HFNUM;                /*!< Host Frame Nbr/Frame Remaining,           Address offset: 408h */
  __IO uint32_t Reserved40C;          /*!< Reserved,                                 Address offset: 40Ch */
  __IO uint32_t HPTXSTS;              /*!< Host Periodic Tx FIFO/ Queue Status,      Address offset: 410h */
  __IO uint32_t HAINT;                /*!< Host All Channels Interrupt Register,     Address offset: 414h */
  __IO uint32_t HAINTMSK;             /*!< Host All Channels Interrupt Mask,         Address offset: 418h */
} USB_OTG_HostTypeDef;

/**
  * @brief USB_OTG_Host_Channel_Specific_Registers
  */
typedef struct
{
  __IO uint32_t HCCHAR;               /*!< Host Channel Characteristics Register,    Address offset: 500h */
  __IO uint32_t HCSPLT;               /*!< Host Channel Split Control Register,      Address offset: 504h */
  __IO uint32_t HCINT;                /*!< Host Channel Interrupt Register,          Address offset: 508h */
  __IO uint32_t HCINTMSK;             /*!< Host Channel Interrupt Mask Register,     Address offset: 50Ch */
  __IO uint32_t HCTSIZ;               /*!< Host Channel Transfer Size Register,      Address offset: 510h */
  __IO uint32_t HCDMA;                /*!< Host Channel DMA Address Register,        Address offset: 514h */
  uint32_t Reserved[2];               /*!< Reserved,                                 Address offset: 518h */
} USB_OTG_HostChannelTypeDef;

typedef struct
{
  __IO uint32_t USBPHYC_CR;           /*!< USB HS PHY Control Register,              Address offset: 000h */
  __IO uint32_t USBPHYC_TRIM1CR;      /*!< USB HS PHY Trimming_1 Register,           Address offset: 004h */
  __IO uint32_t USBPHYC_TRIM2CR;      /*!< USB HS PHY Trimming_2 Register,           Address offset: 008h */
} USB_HS_PHYC_GlobalTypeDef;

/**
  * @brief SPDIF-RX Interface
  */
typedef struct
{
  __IO uint32_t CR;          /*!< Control register,                   Address offset: 0x00 */
  __IO uint32_t IMR;         /*!< Interrupt mask register,            Address offset: 0x04 */
  __IO uint32_t SR;          /*!< Status register,                    Address offset: 0x08 */
  __IO uint32_t IFCR;        /*!< Interrupt Flag Clear register,      Address offset: 0x0C */
  __IO uint32_t DR;          /*!< Data input register,                Address offset: 0x10 */
  __IO uint32_t CSR;         /*!< Channel Status register,            Address offset: 0x14 */
  __IO uint32_t DIR;         /*!< Debug Information register,         Address offset: 0x18 */
} SPDIFRX_TypeDef;


/**
  * @brief System configuration controller
  */
typedef struct
{
  __IO uint32_t BOOTCR;         /*!< SYSCFG boot pin control register,                                            Address offset: 0x00 */
  __IO uint32_t CM55CR;         /*!< SYSCFG Cortex-M55 control register,                                          Address offset: 0x04 */
  __IO uint32_t CM55TCMCR;      /*!< SYSCFG Cortex-M55 TCM control register,                                      Address offset: 0x08 */
  __IO uint32_t CM55RWMCR;      /*!< SYSCFG Cortex-M55 memory RW margin register,                                 Address offset: 0x0C */
  __IO uint32_t INITSVTORCR;    /*!< SYSCFG Cortex-M55 SVTOR control register,                                    Address offset: 0x10 */
  __IO uint32_t INITNSVTORCR;   /*!< Cortex-M55 NSVTOR control register,                                          Address offset: 0x14 */
  __IO uint32_t CM55RSTCR;      /*!< SYSCFG Cortex-M55 reset type control register,                               Address offset: 0x18 */
  __IO uint32_t CM55PAHBWPR;    /*!< SYSCFG Cortex-M55 P-AHB write posting control register,                      Address offset: 0x1C */
  __IO uint32_t VENCRAMCR;      /*!< SYSCFG VENCRAM control register,                                             Address offset: 0x20 */
  __IO uint32_t POTTAMPRSTCR;   /*!< SYSCFG potential tamper reset register,                                      Address offset: 0x24 */
  uint32_t      RESERVED1[3];   /*!< Reserved,                                                                    Address offset: 0x28-0x30 */
  __IO uint32_t ICNEWRCR;       /*!< SYSCFG AHB-AXI bridge early write response,                                  Address offset: 0x34 */
  __IO uint32_t ICNCGCR;        /*!< SYSCFG ICN clock gating control register,                                    Address offset: 0x38 */
  uint32_t      RESERVED2[2];   /*!< Reserved,                                                                    Address offset: 0x3C-0x40 */
  __IO uint32_t VDDIO4CCCR;     /*!< SYSCFG VDDIO4 compensation cell control register,                            Address offset: 0x44 */
  __IO uint32_t VDDIO4CCSR;     /*!< SYSCFG VDDIO4 compensation cell status register,                             Address offset: 0x48 */
  __IO uint32_t VDDIO5CCCR;     /*!< SYSCFG VDDIO5 compensation cell control register,                            Address offset: 0x4C */
  __IO uint32_t VDDIO5CCSR;     /*!< SYSCFG VDDIO5 compensation cell status register,                             Address offset: 0x50 */
  __IO uint32_t VDDIO2CCCR;     /*!< SYSCFG VDDIO2 compensation cell control register,                            Address offset: 0x54 */
  __IO uint32_t VDDIO2CCSR;     /*!< SYSCFG VDDIO2 compensation cell status register,                             Address offset: 0x58 */
  __IO uint32_t VDDIO3CCCR;     /*!< SYSCFG VDDIO3 compensation cell control register,                            Address offset: 0x5C */
  __IO uint32_t VDDIO3CCSR;     /*!< SYSCFG VDDIO3 compensation cell status register,                             Address offset: 0x60 */
  __IO uint32_t VDDCCCR;        /*!< SYSCFG VDD compensation cell control register,                               Address offset: 0x64 */
  __IO uint32_t VDDCCSR;        /*!< SYSCFG VDD compensation cell status register,                                Address offset: 0x68 */
  __IO uint32_t CBR;            /*!< SYSCFG control timer break register,                                         Address offset: 0x6C */
  __IO uint32_t SEC_AIDCR;      /*!< SYSCFG DMA CID secure control register,                                      Address offset: 0x70 */
  __IO uint32_t FMC_RETIMECR;   /*!< SYSCFG FMC retiming logic control register,                                  Address offset: 0x74 */
  uint32_t      RESERVED3[34];  /*!< Reserved,                                                                    Address offset: 0x78-0xFC */
  __IO uint32_t BOOTSR;         /*!< SYSCFG boot pin status register,                                             Address offset: 0x100 */
  __IO uint32_t AHBWP_ERROR_SR; /*!< SYSCFG AHB write posting address error register,                             Address offset: 0x104 */
  uint32_t      RESERVED4[446]; /*!< Reserved,                                                                    Address offset: 0x108-0x3FC */
  __IO uint32_t SECPRIV_AIDCR;  /*!< SYSCFG DMA CID non-secure control register,                                  Address offset: 0x800 */
  uint32_t      RESERVED5[507]; /*!< Reserved,                                                                    Address offset: 0x804-0xFEC */
  __IO uint32_t DEVICEID;       /*!< SYSCFG Device ID,                                                            Address offset: 0xFF0 */
} SYSCFG_TypeDef;

/**
 * @brief Tamper and backup registers
 */
typedef struct
{
 __IO uint32_t CR1;           /*!< TAMP configuration register 1,                    Address offset: 0x00 */
 __IO uint32_t CR2;           /*!< TAMP configuration register 2,                    Address offset: 0x04 */
 __IO uint32_t CR3;           /*!< TAMP configuration register 3,                    Address offset: 0x08 */
 __IO uint32_t FLTCR;         /*!< TAMP filter control register,                     Address offset: 0x0C */
 __IO uint32_t ATCR1;         /*!< TAMP filter control register 1                    Address offset: 0x10 */
 __IO uint32_t ATSEEDR;       /*!< TAMP active tamper seed register,                 Address offset: 0x14 */
 __IO uint32_t ATOR;          /*!< TAMP active tamper output register,               Address offset: 0x18 */
 __IO uint32_t ATCR2;         /*!< TAMP filter control register 2,                   Address offset: 0x1C */
 __IO uint32_t SECCFGR;       /*!< TAMP secure mode control register,                Address offset: 0x20 */
 __IO uint32_t PRIVCFGR;      /*!< TAMP privilege mode control register,             Address offset: 0x24 */
      uint32_t RESERVED2;     /*!< Reserved,                                         Address offset: 0x28 */
 __IO uint32_t IER;           /*!< TAMP interrupt enable register,                   Address offset: 0x2C */
 __IO uint32_t SR;            /*!< TAMP status register,                             Address offset: 0x30 */
 __IO uint32_t MISR;          /*!< TAMP masked interrupt status register,            Address offset: 0x34 */
 __IO uint32_t SMISR;         /*!< TAMP secure masked interrupt status register,     Address offset: 0x38 */
 __IO uint32_t SCR;           /*!< TAMP status clear register,                       Address offset: 0x3C */
 __IO uint32_t COUNT1R;       /*!< TAMP monotonic counter register,                  Address offset: 0x40 */
      uint32_t RESERVED4[3];  /*!< Reserved,                                         Address offset: 0x43 -- 0x4C */
 __IO uint32_t OR;            /*!< TAMP option register,                             Address offset: 0x50 */
 __IO uint32_t RPCFGR;        /*!< TAMP resources protection configuration register, Address offset: 0x54 */
      uint32_t RESERVED5[42]; /*!< Reserved,                                         Address offset: 0x58 -- 0xFC */
 __IO uint32_t BKP0R;         /*!< TAMP backup register 0,                           Address offset: 0x100 */
 __IO uint32_t BKP1R;         /*!< TAMP backup register 1,                           Address offset: 0x104 */
 __IO uint32_t BKP2R;         /*!< TAMP backup register 2,                           Address offset: 0x108 */
 __IO uint32_t BKP3R;         /*!< TAMP backup register 3,                           Address offset: 0x10C */
 __IO uint32_t BKP4R;         /*!< TAMP backup register 4,                           Address offset: 0x110 */
 __IO uint32_t BKP5R;         /*!< TAMP backup register 5,                           Address offset: 0x114 */
 __IO uint32_t BKP6R;         /*!< TAMP backup register 6,                           Address offset: 0x118 */
 __IO uint32_t BKP7R;         /*!< TAMP backup register 7,                           Address offset: 0x11C */
 __IO uint32_t BKP8R;         /*!< TAMP backup register 8,                           Address offset: 0x120 */
 __IO uint32_t BKP9R;         /*!< TAMP backup register 9,                           Address offset: 0x124 */
 __IO uint32_t BKP10R;        /*!< TAMP backup register 10,                          Address offset: 0x128 */
 __IO uint32_t BKP11R;        /*!< TAMP backup register 11,                          Address offset: 0x12C */
 __IO uint32_t BKP12R;        /*!< TAMP backup register 12,                          Address offset: 0x130 */
 __IO uint32_t BKP13R;        /*!< TAMP backup register 13,                          Address offset: 0x134 */
 __IO uint32_t BKP14R;        /*!< TAMP backup register 14,                          Address offset: 0x138 */
 __IO uint32_t BKP15R;        /*!< TAMP backup register 15,                          Address offset: 0x13C */
 __IO uint32_t BKP16R;        /*!< TAMP backup register 16,                          Address offset: 0x140 */
 __IO uint32_t BKP17R;        /*!< TAMP backup register 17,                          Address offset: 0x144 */
 __IO uint32_t BKP18R;        /*!< TAMP backup register 18,                          Address offset: 0x148 */
 __IO uint32_t BKP19R;        /*!< TAMP backup register 19,                          Address offset: 0x14C */
 __IO uint32_t BKP20R;        /*!< TAMP backup register 20,                          Address offset: 0x150 */
 __IO uint32_t BKP21R;        /*!< TAMP backup register 21,                          Address offset: 0x154 */
 __IO uint32_t BKP22R;        /*!< TAMP backup register 22,                          Address offset: 0x158 */
 __IO uint32_t BKP23R;        /*!< TAMP backup register 23,                          Address offset: 0x15C */
 __IO uint32_t BKP24R;        /*!< TAMP backup register 24,                          Address offset: 0x160 */
 __IO uint32_t BKP25R;        /*!< TAMP backup register 25,                          Address offset: 0x164 */
 __IO uint32_t BKP26R;        /*!< TAMP backup register 26,                          Address offset: 0x168 */
 __IO uint32_t BKP27R;        /*!< TAMP backup register 27,                          Address offset: 0x16C */
 __IO uint32_t BKP28R;        /*!< TAMP backup register 28,                          Address offset: 0x170 */
 __IO uint32_t BKP29R;        /*!< TAMP backup register 29,                          Address offset: 0x174 */
 __IO uint32_t BKP30R;        /*!< TAMP backup register 30,                          Address offset: 0x178 */
 __IO uint32_t BKP31R;        /*!< TAMP backup register 31,                          Address offset: 0x17C */
} TAMP_TypeDef;

/**
  * @brief TIM
  */
typedef struct
{
  __IO uint32_t CR1;            /*!< TIM control register 1,                   Address offset:  0x00 */
  __IO uint32_t CR2;            /*!< TIM control register 2,                   Address offset:  0x04 */
  __IO uint32_t SMCR;           /*!< TIM slave mode control register,          Address offset:  0x08 */
  __IO uint32_t DIER;           /*!< TIM DMA/interrupt enable register,        Address offset:  0x0C */
  __IO uint32_t SR;             /*!< TIM status register,                      Address offset:  0x10 */
  __IO uint32_t EGR;            /*!< TIM event generation register,            Address offset:  0x14 */
  __IO uint32_t CCMR1;          /*!< TIM capture/compare mode register 1,      Address offset:  0x18 */
  __IO uint32_t CCMR2;          /*!< TIM capture/compare mode register 2,      Address offset:  0x1C */
  __IO uint32_t CCER;           /*!< TIM capture/compare enable register,      Address offset:  0x20 */
  __IO uint32_t CNT;            /*!< TIM counter register,                     Address offset:  0x24 */
  __IO uint32_t PSC;            /*!< TIM prescaler,                            Address offset:  0x28 */
  __IO uint32_t ARR;            /*!< TIM auto-reload register,                 Address offset:  0x2C */
  __IO uint32_t RCR;            /*!< TIM repetition counter register,          Address offset:  0x30 */
  __IO uint32_t CCR1;           /*!< TIM capture/compare register 1,           Address offset:  0x34 */
  __IO uint32_t CCR2;           /*!< TIM capture/compare register 2,           Address offset:  0x38 */
  __IO uint32_t CCR3;           /*!< TIM capture/compare register 3,           Address offset:  0x3C */
  __IO uint32_t CCR4;           /*!< TIM capture/compare register 4,           Address offset:  0x40 */
  __IO uint32_t BDTR;           /*!< TIM break and dead-time register,         Address offset:  0x44 */
  __IO uint32_t CCR5;           /*!< TIM capture/compare register 5,           Address offset:  0x48 */
  __IO uint32_t CCR6;           /*!< TIM capture/compare register 6,           Address offset:  0x4C */
  __IO uint32_t CCMR3;          /*!< TIM capture/compare mode register 3,      Address offset:  0x50 */
  __IO uint32_t DTR2;           /*!< TIM deadtime register 2,                  Address offset:  0x54 */
  __IO uint32_t ECR;            /*!< TIM encoder control register,             Address offset:  0x58 */
  __IO uint32_t TISEL;          /*!< TIM Input Selection register,             Address offset:  0x5C */
  __IO uint32_t AF1;            /*!< TIM alternate function option register 1, Address offset:  0x60 */
  __IO uint32_t AF2;            /*!< TIM alternate function option register 2, Address offset:  0x64 */
       uint32_t RESERVED1[221]; /*!< Reserved,                                            0x6C-0x3D8 */
  __IO uint32_t DCR;            /*!< TIM DMA control register,                 Address offset: 0x3DC */
  __IO uint32_t DMAR;           /*!< TIM DMA address for full transfer,        Address offset: 0x3E0 */
} TIM_TypeDef;


/**
  * @brief Universal Synchronous Asynchronous Receiver Transmitter
  */
typedef struct
{
  __IO uint32_t CR1;         /*!< USART Control register 1,                 Address offset: 0x00 */
  __IO uint32_t CR2;         /*!< USART Control register 2,                 Address offset: 0x04 */
  __IO uint32_t CR3;         /*!< USART Control register 3,                 Address offset: 0x08 */
  __IO uint32_t BRR;         /*!< USART Baud rate register,                 Address offset: 0x0C */
  __IO uint32_t GTPR;        /*!< USART Guard time and prescaler register,  Address offset: 0x10 */
  __IO uint32_t RTOR;        /*!< USART Receiver Time Out register,         Address offset: 0x14 */
  __IO uint32_t RQR;         /*!< USART Request register,                   Address offset: 0x18 */
  __IO uint32_t ISR;         /*!< USART Interrupt and status register,      Address offset: 0x1C */
  __IO uint32_t ICR;         /*!< USART Interrupt flag Clear register,      Address offset: 0x20 */
  __IO uint32_t RDR;         /*!< USART Receive Data register,              Address offset: 0x24 */
  __IO uint32_t TDR;         /*!< USART Transmit Data register,             Address offset: 0x28 */
  __IO uint32_t PRESC;       /*!< USART Prescaler register,                 Address offset: 0x2C */
} USART_TypeDef;


/**
  * @brief VREFBUF
  */
typedef struct
{
  __IO uint32_t CSR;         /*!< VREFBUF control and status register,         Address offset: 0x00 */
  __IO uint32_t CCR;         /*!< VREFBUF calibration and control register,    Address offset: 0x04 */
} VREFBUF_TypeDef;


/**
  * @brief Window Watchdog
  */
typedef struct
{
  __IO uint32_t CR;          /*!< WWDG Control register,              Address offset: 0x00 */
  __IO uint32_t CFR;         /*!< WWDG Configuration register,        Address offset: 0x04 */
  __IO uint32_t SR;          /*!< WWDG Status register,               Address offset: 0x08 */
} WWDG_TypeDef;

