micropython/micropython/lib/stm32n6/CMSIS/STM32N6xx/Include/stm32n655xx.h
#define SERC_BASE_S                     (APB4PERIPH_BASE_S + 0x7C00UL)
#define SYSCFG_BASE_S                   (APB4PERIPH_BASE_S + 0x8000UL)
#define BSEC_BASE_S                     (APB4PERIPH_BASE_S + 0x9000UL)
#define DTS_BASE_S                      (APB4PERIPH_BASE_S + 0xA000UL)
#define DTS_Sensor0_BASE_S              (DTS_BASE_S + 0x0C0UL)
#define DTS_Sensor1_BASE_S              (DTS_BASE_S + 0x100UL)

/*!< AHB4 peripherals */
#define GPIOA_BASE_S                    (AHB4PERIPH_BASE_S + 0x0000UL)
#define GPIOB_BASE_S                    (AHB4PERIPH_BASE_S + 0x0400UL)
#define GPIOC_BASE_S                    (AHB4PERIPH_BASE_S + 0x0800UL)
#define GPIOD_BASE_S                    (AHB4PERIPH_BASE_S + 0x0C00UL)
#define GPIOE_BASE_S                    (AHB4PERIPH_BASE_S + 0x1000UL)
#define GPIOF_BASE_S                    (AHB4PERIPH_BASE_S + 0x1400UL)
#define GPIOG_BASE_S                    (AHB4PERIPH_BASE_S + 0x1800UL)
#define GPIOH_BASE_S                    (AHB4PERIPH_BASE_S + 0x1C00UL)
#define GPION_BASE_S                    (AHB4PERIPH_BASE_S + 0x3400UL)
#define GPIOO_BASE_S                    (AHB4PERIPH_BASE_S + 0x3800UL)
#define GPIOP_BASE_S                    (AHB4PERIPH_BASE_S + 0x3C00UL)
#define GPIOQ_BASE_S                    (AHB4PERIPH_BASE_S + 0x4000UL)
#define PWR_BASE_S                      (AHB4PERIPH_BASE_S + 0x4800UL)
#define CRC_BASE_S                      (AHB4PERIPH_BASE_S + 0x4C00UL)
#define EXTI_BASE_S                     (AHB4PERIPH_BASE_S + 0x5000UL)
#define RCC_BASE_S                      (AHB4PERIPH_BASE_S + 0x8000UL)

/*!< APB5 peripherals */
#define LTDC_BASE_S                     (APB5PERIPH_BASE_S + 0x1000UL)
#define LTDC_Layer1_BASE_S              (LTDC_BASE_S + 0x0100UL)
#define LTDC_Layer2_BASE_S              (LTDC_BASE_S + 0x0200UL)
#define DCMIPP_BASE_S                   (APB5PERIPH_BASE_S + 0x2000UL)
#define GFXTIM_BASE_S                   (APB5PERIPH_BASE_S + 0x4000UL)
#define VENC_BASE_S                     (APB5PERIPH_BASE_S + 0x5000UL)
#define CSI_BASE_S                      (APB5PERIPH_BASE_S + 0x6000UL)

/*!< AHB5 peripherals */
#define HPDMA1_BASE_S                   (AHB5PERIPH_BASE_S + 0x0000UL)
#define HPDMA1_Channel0_BASE_S          (HPDMA1_BASE_S + 0x0050UL)
#define HPDMA1_Channel1_BASE_S          (HPDMA1_BASE_S + 0x00D0UL)
#define HPDMA1_Channel2_BASE_S          (HPDMA1_BASE_S + 0x0150UL)
#define HPDMA1_Channel3_BASE_S          (HPDMA1_BASE_S + 0x01D0UL)
#define HPDMA1_Channel4_BASE_S          (HPDMA1_BASE_S + 0x0250UL)
#define HPDMA1_Channel5_BASE_S          (HPDMA1_BASE_S + 0x02D0UL)
#define HPDMA1_Channel6_BASE_S          (HPDMA1_BASE_S + 0x0350UL)
#define HPDMA1_Channel7_BASE_S          (HPDMA1_BASE_S + 0x03D0UL)
#define HPDMA1_Channel8_BASE_S          (HPDMA1_BASE_S + 0x0450UL)
#define HPDMA1_Channel9_BASE_S          (HPDMA1_BASE_S + 0x04D0UL)
#define HPDMA1_Channel10_BASE_S         (HPDMA1_BASE_S + 0x0550UL)
#define HPDMA1_Channel11_BASE_S         (HPDMA1_BASE_S + 0x05D0UL)
#define HPDMA1_Channel12_BASE_S         (HPDMA1_BASE_S + 0x0650UL)
#define HPDMA1_Channel13_BASE_S         (HPDMA1_BASE_S + 0x06D0UL)
#define HPDMA1_Channel14_BASE_S         (HPDMA1_BASE_S + 0x0750UL)
#define HPDMA1_Channel15_BASE_S         (HPDMA1_BASE_S + 0x07D0UL)
#define DMA2D_BASE_S                    (AHB5PERIPH_BASE_S + 0x1000UL)
#define JPEG_BASE_S                     (AHB5PERIPH_BASE_S + 0x3000UL)
#define FMC_R_BASE_S                    (AHB5PERIPH_BASE_S + 0x4000UL)
#define FMC_Bank1_R_BASE_S              (FMC_R_BASE_S + 0x0000UL)
#define FMC_Bank1E_R_BASE_S             (FMC_R_BASE_S + 0x0104UL)
#define FMC_Bank3_R_BASE_S              (FMC_R_BASE_S + 0x0080UL)
#define FMC_Bank5_6_R_BASE_S            (FMC_R_BASE_S + 0x0140UL)
#define FMC_Common_R_BASE_S             (FMC_R_BASE_S + 0x0020UL)
#define XSPI1_BASE_S                    (AHB5PERIPH_BASE_S + 0x5000UL)
#define PSSI_BASE_S                     (AHB5PERIPH_BASE_S + 0x6400UL)
#define SDMMC2_BASE_S                   (AHB5PERIPH_BASE_S + 0x6800UL)
#define DLYB_SDMMC2_BASE_S              (AHB5PERIPH_BASE_S + 0x6C00UL)
#define SDMMC1_BASE_S                   (AHB5PERIPH_BASE_S + 0x7000UL)
#define DLYB_SDMMC1_BASE_S              (AHB5PERIPH_BASE_S + 0x8000UL)
#define DCMI_BASE_S                     (AHB5PERIPH_BASE_S + 0x8400UL)
#define XSPI2_BASE_S                    (AHB5PERIPH_BASE_S + 0xA000UL)
#define XSPIM_BASE_S                    (AHB5PERIPH_BASE_S + 0xB400UL)
#define MCE1_BASE_S                     (AHB5PERIPH_BASE_S + 0xB800UL)
#define MCE1_REGION1_BASE_S             (MCE1_BASE_S + 0x040UL)
#define MCE1_REGION2_BASE_S             (MCE1_BASE_S + 0x050UL)
#define MCE1_REGION3_BASE_S             (MCE1_BASE_S + 0x060UL)
#define MCE1_REGION4_BASE_S             (MCE1_BASE_S + 0x070UL)
#define MCE1_CONTEXT1_BASE_S            (MCE1_BASE_S + 0x240UL)
#define MCE1_CONTEXT2_BASE_S            (MCE1_BASE_S + 0x270UL)
#define MCE2_BASE_S                     (AHB5PERIPH_BASE_S + 0xBC00UL)
#define MCE2_REGION1_BASE_S             (MCE2_BASE_S + 0x040UL)
#define MCE2_REGION2_BASE_S             (MCE2_BASE_S + 0x050UL)
#define MCE2_REGION3_BASE_S             (MCE2_BASE_S + 0x060UL)
#define MCE2_REGION4_BASE_S             (MCE2_BASE_S + 0x070UL)
#define MCE2_CONTEXT1_BASE_S            (MCE2_BASE_S + 0x240UL)
#define MCE2_CONTEXT2_BASE_S            (MCE2_BASE_S + 0x270UL)
#define MCE3_BASE_S                     (AHB5PERIPH_BASE_S + 0xC000UL)
#define MCE3_REGION1_BASE_S             (MCE3_BASE_S + 0x040UL)
#define MCE3_REGION2_BASE_S             (MCE3_BASE_S + 0x050UL)
#define MCE3_REGION3_BASE_S             (MCE3_BASE_S + 0x060UL)
#define MCE3_REGION4_BASE_S             (MCE3_BASE_S + 0x070UL)
#define MCE3_CONTEXT1_BASE_S            (MCE3_BASE_S + 0x240UL)
#define MCE3_CONTEXT2_BASE_S            (MCE3_BASE_S + 0x270UL)
#define MCE4_BASE_S                     (AHB5PERIPH_BASE_S + 0xE000UL)
#define MCE4_REGION1_BASE_S             (MCE4_BASE_S + 0x040UL)
#define MCE4_REGION2_BASE_S             (MCE4_BASE_S + 0x050UL)
#define MCE4_REGION3_BASE_S             (MCE4_BASE_S + 0x060UL)
#define MCE4_REGION4_BASE_S             (MCE4_BASE_S + 0x070UL)
#define MCE4_CONTEXT1_BASE_S            (MCE4_BASE_S + 0x240UL)
#define MCE4_CONTEXT2_BASE_S            (MCE4_BASE_S + 0x270UL)
#define XSPI3_BASE_S                    (AHB5PERIPH_BASE_S + 0xD000UL)
#define GFXMMU_BASE_S                   (AHB5PERIPH_BASE_S + 0x010000UL)
#define GPU2D_BASE_S                    (AHB5PERIPH_BASE_S + 0x014000UL)
#define GPUCACHE_BASE_S                 (AHB5PERIPH_BASE_S + 0x015000UL)
#define ICACHE_BASE_S                   (AHB5PERIPH_BASE_S + 0x015000UL)
#define ETH1_BASE_S                     (AHB5PERIPH_BASE_S + 0x016000UL)
#define ETH1_MAC_BASE_S                 (ETH1_BASE_S)
#define USB1_HS_PHYC_BASE_S             (AHB5PERIPH_BASE_S + 0x01FC00UL)
#define USB2_HS_PHYC_BASE_S             (AHB5PERIPH_BASE_S + 0x0A0000UL)
#define USB1_OTG_HS_BASE_S              (AHB5PERIPH_BASE_S + 0x020000UL)
#define USB2_OTG_HS_BASE_S              (AHB5PERIPH_BASE_S + 0x060000UL)


