micropython/micropython/lib/stm32n6/CMSIS/STM32N6xx/Include/stm32n655xx.h
#if defined (CPU_IN_SECURE_STATE)
#define ADC12_COMMON_S            ((ADC_Common_TypeDef *) ADC12_COMMON_BASE_S)
#define ADC1_S                    ((ADC_TypeDef *) ADC1_BASE_S)
#define ADC2_S                    ((ADC_TypeDef *) ADC2_BASE_S)
#define ADF1_S                    ((MDF_TypeDef *) ADF1_BASE_S)
#define ADF1_Filter0_S            ((MDF_Filter_TypeDef *) ADF1_Filter0_BASE_S)
#define BSEC_S                    ((BSEC_TypeDef *) BSEC_BASE_S)
#define CRC_S                     ((CRC_TypeDef *) CRC_BASE_S)
#define CRYP_S                    ((CRYP_TypeDef *) CRYP_BASE_S)
#define CSI_S                     ((CSI_TypeDef *) CSI_BASE_S)
#define DBGMCU_S                  ((DBGMCU_TypeDef *) DBGMCU_BASE_S)
#define DCMI_S                    ((DCMI_TypeDef *) DCMI_BASE_S)
#define DCMIPP_S                  ((DCMIPP_TypeDef *) DCMIPP_BASE_S)
#define DLYB_SDMMC1_S             ((DLYB_TypeDef *) DLYB_SDMMC1_BASE_S)
#define DLYB_SDMMC2_S             ((DLYB_TypeDef *) DLYB_SDMMC2_BASE_S)
#define DMA2D_S                   ((DMA2D_TypeDef *) DMA2D_BASE_S)
#define DTS_S                     ((DTS_TypeDef *) DTS_BASE_S)
#define DTS_Sensor0_S             ((DTS_SensorTypeDef *) DTS_Sensor0_BASE_S)
#define DTS_Sensor1_S             ((DTS_SensorTypeDef *) DTS_Sensor1_BASE_S)
#define ETH1_S                    ((ETH_TypeDef *) ETH1_BASE_S)
#define EXTI_S                    ((EXTI_TypeDef *) EXTI_BASE_S)
#define FDCAN1_S                  ((FDCAN_GlobalTypeDef *) FDCAN1_BASE_S)
#define FDCAN2_S                  ((FDCAN_GlobalTypeDef *) FDCAN2_BASE_S)
#define FDCAN3_S                  ((FDCAN_GlobalTypeDef *) FDCAN3_BASE_S)
#define FDCAN_CCU_S               ((FDCAN_ClockCalibrationUnit_TypeDef *) FDCAN_CCU_BASE_S)
#define FMC_Bank1E_R_S            ((FMC_Bank1E_TypeDef *) FMC_Bank1E_R_BASE_S)
#define FMC_Bank1_R_S             ((FMC_Bank1_TypeDef *) FMC_Bank1_R_BASE_S)
#define FMC_Bank3_R_S             ((FMC_Bank3_TypeDef *) FMC_Bank3_R_BASE_S)
#define FMC_Bank5_6_R_S           ((FMC_Bank5_6_TypeDef *) FMC_Bank5_6_R_BASE_S)
#define FMC_Common_R_S            ((FMC_Common_TypeDef *) FMC_Common_R_BASE_S)
#define GFXMMU_S                  ((GFXMMU_TypeDef *) GFXMMU_BASE_S)
#define GFXTIM_S                  ((GFXTIM_TypeDef *) GFXTIM_BASE_S)
#define GPDMA1_S                  ((DMA_TypeDef *) GPDMA1_BASE_S)
#define GPDMA1_Channel0_S         ((DMA_Channel_TypeDef *) GPDMA1_Channel0_BASE_S)
#define GPDMA1_Channel1_S         ((DMA_Channel_TypeDef *) GPDMA1_Channel1_BASE_S)
#define GPDMA1_Channel2_S         ((DMA_Channel_TypeDef *) GPDMA1_Channel2_BASE_S)
#define GPDMA1_Channel3_S         ((DMA_Channel_TypeDef *) GPDMA1_Channel3_BASE_S)
#define GPDMA1_Channel4_S         ((DMA_Channel_TypeDef *) GPDMA1_Channel4_BASE_S)
#define GPDMA1_Channel5_S         ((DMA_Channel_TypeDef *) GPDMA1_Channel5_BASE_S)
#define GPDMA1_Channel6_S         ((DMA_Channel_TypeDef *) GPDMA1_Channel6_BASE_S)
#define GPDMA1_Channel7_S         ((DMA_Channel_TypeDef *) GPDMA1_Channel7_BASE_S)
#define GPDMA1_Channel8_S         ((DMA_Channel_TypeDef *) GPDMA1_Channel8_BASE_S)
#define GPDMA1_Channel9_S         ((DMA_Channel_TypeDef *) GPDMA1_Channel9_BASE_S)
#define GPDMA1_Channel10_S        ((DMA_Channel_TypeDef *) GPDMA1_Channel10_BASE_S)
#define GPDMA1_Channel11_S        ((DMA_Channel_TypeDef *) GPDMA1_Channel11_BASE_S)
#define GPDMA1_Channel12_S        ((DMA_Channel_TypeDef *) GPDMA1_Channel12_BASE_S)
#define GPDMA1_Channel13_S        ((DMA_Channel_TypeDef *) GPDMA1_Channel13_BASE_S)
#define GPDMA1_Channel14_S        ((DMA_Channel_TypeDef *) GPDMA1_Channel14_BASE_S)
#define GPDMA1_Channel15_S        ((DMA_Channel_TypeDef *) GPDMA1_Channel15_BASE_S)
#define GPIOA_S                   ((GPIO_TypeDef *) GPIOA_BASE_S)
#define GPIOB_S                   ((GPIO_TypeDef *) GPIOB_BASE_S)
#define GPIOC_S                   ((GPIO_TypeDef *) GPIOC_BASE_S)
#define GPIOD_S                   ((GPIO_TypeDef *) GPIOD_BASE_S)
#define GPIOE_S                   ((GPIO_TypeDef *) GPIOE_BASE_S)
#define GPIOF_S                   ((GPIO_TypeDef *) GPIOF_BASE_S)
#define GPIOG_S                   ((GPIO_TypeDef *) GPIOG_BASE_S)
#define GPIOH_S                   ((GPIO_TypeDef *) GPIOH_BASE_S)
#define GPION_S                   ((GPIO_TypeDef *) GPION_BASE_S)
#define GPIOO_S                   ((GPIO_TypeDef *) GPIOO_BASE_S)
#define GPIOP_S                   ((GPIO_TypeDef *) GPIOP_BASE_S)
#define GPIOQ_S                   ((GPIO_TypeDef *) GPIOQ_BASE_S)
#define HASH_S                    ((HASH_TypeDef *) HASH_BASE_S)
#define HASH_DIGEST_S             ((HASH_DIGEST_TypeDef *) HASH_DIGEST_BASE_S)
#define HPDMA1_S                  ((DMA_TypeDef *) HPDMA1_BASE_S)
#define HPDMA1_Channel0_S         ((DMA_Channel_TypeDef *) HPDMA1_Channel0_BASE_S)
#define HPDMA1_Channel1_S         ((DMA_Channel_TypeDef *) HPDMA1_Channel1_BASE_S)
#define HPDMA1_Channel2_S         ((DMA_Channel_TypeDef *) HPDMA1_Channel2_BASE_S)
#define HPDMA1_Channel3_S         ((DMA_Channel_TypeDef *) HPDMA1_Channel3_BASE_S)
#define HPDMA1_Channel4_S         ((DMA_Channel_TypeDef *) HPDMA1_Channel4_BASE_S)
#define HPDMA1_Channel5_S         ((DMA_Channel_TypeDef *) HPDMA1_Channel5_BASE_S)
#define HPDMA1_Channel6_S         ((DMA_Channel_TypeDef *) HPDMA1_Channel6_BASE_S)
#define HPDMA1_Channel7_S         ((DMA_Channel_TypeDef *) HPDMA1_Channel7_BASE_S)
#define HPDMA1_Channel8_S         ((DMA_Channel_TypeDef *) HPDMA1_Channel8_BASE_S)
#define HPDMA1_Channel9_S         ((DMA_Channel_TypeDef *) HPDMA1_Channel9_BASE_S)
#define HPDMA1_Channel10_S        ((DMA_Channel_TypeDef *) HPDMA1_Channel10_BASE_S)
#define HPDMA1_Channel11_S        ((DMA_Channel_TypeDef *) HPDMA1_Channel11_BASE_S)
#define HPDMA1_Channel12_S        ((DMA_Channel_TypeDef *) HPDMA1_Channel12_BASE_S)
#define HPDMA1_Channel13_S        ((DMA_Channel_TypeDef *) HPDMA1_Channel13_BASE_S)
#define HPDMA1_Channel14_S        ((DMA_Channel_TypeDef *) HPDMA1_Channel14_BASE_S)
#define HPDMA1_Channel15_S        ((DMA_Channel_TypeDef *) HPDMA1_Channel15_BASE_S)
#define I2C1_S                    ((I2C_TypeDef *) I2C1_BASE_S)
#define I2C2_S                    ((I2C_TypeDef *) I2C2_BASE_S)
#define I2C3_S                    ((I2C_TypeDef *) I2C3_BASE_S)
#define I2C4_S                    ((I2C_TypeDef *) I2C4_BASE_S)
#define I3C1_S                    ((I3C_TypeDef *) I3C1_BASE_S)
#define I3C2_S                    ((I3C_TypeDef *) I3C2_BASE_S)
#define IAC_S                     ((IAC_TypeDef *) IAC_BASE_S)
#define ICACHE_S                  ((ICACHE_TypeDef *) ICACHE_BASE_S)
#define IWDG_S                    ((IWDG_TypeDef *) IWDG_BASE_S)
#define JPEG_S                    ((JPEG_TypeDef *) JPEG_BASE_S)
#define LPTIM1_S                  ((LPTIM_TypeDef *) LPTIM1_BASE_S)
#define LPTIM2_S                  ((LPTIM_TypeDef *) LPTIM2_BASE_S)
#define LPTIM3_S                  ((LPTIM_TypeDef *) LPTIM3_BASE_S)
#define LPTIM4_S                  ((LPTIM_TypeDef *) LPTIM4_BASE_S)
#define LPTIM5_S                  ((LPTIM_TypeDef *) LPTIM5_BASE_S)
#define LPUART1_S                 ((USART_TypeDef *) LPUART1_BASE_S)
#define LTDC_S                    ((LTDC_TypeDef *)LTDC_BASE_S)
#define LTDC_Layer1_S             ((LTDC_Layer_TypeDef *)LTDC_Layer1_BASE_S)
#define LTDC_Layer2_S             ((LTDC_Layer_TypeDef *)LTDC_Layer2_BASE_S)
#define MCE1_S                    ((MCE_TypeDef *) MCE1_BASE_S)
#define MCE1_REGION1_S            ((MCE_Region_TypeDef *) MCE1_REGION1_BASE_S)
#define MCE1_REGION2_S            ((MCE_Region_TypeDef *) MCE1_REGION2_BASE_S)
#define MCE1_REGION3_S            ((MCE_Region_TypeDef *) MCE1_REGION3_BASE_S)
#define MCE1_REGION4_S            ((MCE_Region_TypeDef *) MCE1_REGION4_BASE_S)
#define MCE1_CONTEXT1_S           ((MCE_Context_TypeDef *) MCE1_CONTEXT1_BASE_S)
#define MCE1_CONTEXT2_S           ((MCE_Context_TypeDef *) MCE1_CONTEXT2_BASE_S)
#define MCE2_S                    ((MCE_TypeDef *) MCE2_BASE_S)
#define MCE2_REGION1_S            ((MCE_Region_TypeDef *) MCE2_REGION1_BASE_S)
#define MCE2_REGION2_S            ((MCE_Region_TypeDef *) MCE2_REGION2_BASE_S)
#define MCE2_REGION3_S            ((MCE_Region_TypeDef *) MCE2_REGION3_BASE_S)
#define MCE2_REGION4_S            ((MCE_Region_TypeDef *) MCE2_REGION4_BASE_S)
#define MCE2_CONTEXT1_S           ((MCE_Context_TypeDef *) MCE2_CONTEXT1_BASE_S)
#define MCE2_CONTEXT2_S           ((MCE_Context_TypeDef *) MCE2_CONTEXT2_BASE_S)
#define MCE3_S                    ((MCE_TypeDef *) MCE3_BASE_S)
#define MCE3_REGION1_S            ((MCE_Region_TypeDef *) MCE3_REGION1_BASE_S)
#define MCE3_REGION2_S            ((MCE_Region_TypeDef *) MCE3_REGION2_BASE_S)
#define MCE3_REGION3_S            ((MCE_Region_TypeDef *) MCE3_REGION3_BASE_S)
#define MCE3_REGION4_S            ((MCE_Region_TypeDef *) MCE3_REGION4_BASE_S)
#define MCE3_CONTEXT1_S           ((MCE_Context_TypeDef *) MCE3_CONTEXT1_BASE_S)
#define MCE3_CONTEXT2_S           ((MCE_Context_TypeDef *) MCE3_CONTEXT2_BASE_S)
#define MCE4_S                    ((MCE_TypeDef *) MCE4_BASE_S)
#define MCE4_REGION1_S            ((MCE_Region_TypeDef *) MCE4_REGION1_BASE_S)
#define MCE4_REGION2_S            ((MCE_Region_TypeDef *) MCE4_REGION2_BASE_S)
#define MCE4_REGION3_S            ((MCE_Region_TypeDef *) MCE4_REGION3_BASE_S)
#define MCE4_REGION4_S            ((MCE_Region_TypeDef *) MCE4_REGION4_BASE_S)
#define MCE4_CONTEXT1_S           ((MCE_Context_TypeDef *) MCE4_CONTEXT1_BASE_S)
#define MCE4_CONTEXT2_S           ((MCE_Context_TypeDef *) MCE4_CONTEXT2_BASE_S)
#define MDF1_S                    ((MDF_TypeDef *) MDF1_BASE_S)
#define MDF1_Filter0_S            ((MDF_Filter_TypeDef *) MDF1_Filter0_BASE_S)
#define MDF1_Filter1_S            ((MDF_Filter_TypeDef *) MDF1_Filter1_BASE_S)
#define MDF1_Filter2_S            ((MDF_Filter_TypeDef *) MDF1_Filter2_BASE_S)
#define MDF1_Filter3_S            ((MDF_Filter_TypeDef *) MDF1_Filter3_BASE_S)
#define MDF1_Filter4_S            ((MDF_Filter_TypeDef *) MDF1_Filter4_BASE_S)
#define MDF1_Filter5_S            ((MDF_Filter_TypeDef *) MDF1_Filter5_BASE_S)
#define MDIOS_S                   ((MDIOS_TypeDef *) MDIOS_BASE_S)
#define PKA_S                     ((PKA_TypeDef *) PKA_BASE_S)
#define PSSI_S                    ((PSSI_TypeDef *) PSSI_BASE_S)
#define PWR_S                     ((PWR_TypeDef *) PWR_BASE_S)
#define RAMCFG_S                  ((RAMCFG_TypeDef *) RAMCFG_BASE_S)
#define RAMCFG_SRAM1_AXI_S        ((RAMCFG_TypeDef *) RAMCFG_SRAM1_AXI_BASE_S)
#define RAMCFG_SRAM2_AXI_S        ((RAMCFG_TypeDef *) RAMCFG_SRAM2_AXI_BASE_S)
#define RAMCFG_SRAM3_AXI_S        ((RAMCFG_TypeDef *) RAMCFG_SRAM3_AXI_BASE_S)
#define RAMCFG_SRAM4_AXI_S        ((RAMCFG_TypeDef *) RAMCFG_SRAM4_AXI_BASE_S)
#define RAMCFG_SRAM5_AXI_S        ((RAMCFG_TypeDef *) RAMCFG_SRAM5_AXI_BASE_S)
#define RAMCFG_SRAM6_AXI_S        ((RAMCFG_TypeDef *) RAMCFG_SRAM6_AXI_BASE_S)
#define RAMCFG_SRAM1_AHB_S        ((RAMCFG_TypeDef *) RAMCFG_SRAM1_AHB_BASE_S)
#define RAMCFG_SRAM2_AHB_S        ((RAMCFG_TypeDef *) RAMCFG_SRAM2_AHB_BASE_S)
#define RAMCFG_VENC_RAM_S         ((RAMCFG_TypeDef *) RAMCFG_VENC_RAM_BASE_NS)
#define RAMCFG_BKPSRAM_S          ((RAMCFG_TypeDef *) RAMCFG_BKPSRAM_BASE_S)
#define RAMCFG_FLEXRAM_S          ((RAMCFG_TypeDef *) RAMCFG_FLEXRAM_BASE_S)
#define RCC_S                     ((RCC_TypeDef *) RCC_BASE_S)
#define RIFSC_S                   ((RIFSC_TypeDef *) RIFSC_BASE_S)
#define RISAF1_S                  ((RISAF_TypeDef *) RISAF1_BASE_S)
#define RISAF2_S                  ((RISAF_TypeDef *) RISAF2_BASE_S)
#define RISAF3_S                  ((RISAF_TypeDef *) RISAF3_BASE_S)
#define RISAF6_S                  ((RISAF_TypeDef *) RISAF6_BASE_S)
#define RISAF7_S                  ((RISAF_TypeDef *) RISAF7_BASE_S)
#define RISAF8_S                  ((RISAF_TypeDef *) RISAF8_BASE_S)
#define RISAF9_S                  ((RISAF_TypeDef *) RISAF9_BASE_S)
#define RISAF11_S                 ((RISAF_TypeDef *) RISAF11_BASE_S)
#define RISAF12_S                 ((RISAF_TypeDef *) RISAF12_BASE_S)
#define RISAF13_S                 ((RISAF_TypeDef *) RISAF13_BASE_S)
#define RISAF14_S                 ((RISAF_TypeDef *) RISAF14_BASE_S)
#define RISAF21_S                 ((RISAF_TypeDef *) RISAF21_BASE_S)
#define RISAF22_S                 ((RISAF_TypeDef *) RISAF22_BASE_S)
#define RISAF23_S                 ((RISAF_TypeDef *) RISAF23_BASE_S)
#define RNG_S                     ((RNG_TypeDef *) RNG_BASE_S)
#define RTC_S                     ((RTC_TypeDef *) RTC_BASE_S)
#define SAES_S                    ((SAES_TypeDef *) SAES_BASE_S)
#define SAI1_S                    ((SAI_TypeDef *) SAI1_BASE_S)
#define SAI1_Block_A_S            ((SAI_Block_TypeDef *) SAI1_Block_A_BASE_S)
#define SAI1_Block_B_S            ((SAI_Block_TypeDef *) SAI1_Block_B_BASE_S)
#define SAI2_S                    ((SAI_TypeDef *) SAI2_BASE_S)
#define SAI2_Block_A_S            ((SAI_Block_TypeDef *) SAI2_Block_A_BASE_S)
#define SAI2_Block_B_S            ((SAI_Block_TypeDef *) SAI2_Block_B_BASE_S)
#define SDMMC1_S                  ((SDMMC_TypeDef *) SDMMC1_BASE_S)
#define SDMMC2_S                  ((SDMMC_TypeDef *) SDMMC2_BASE_S)
#define SPDIFRX_S                 ((SPDIFRX_TypeDef *) SPDIFRX_BASE_S)
#define SPI1_S                    ((SPI_TypeDef *) SPI1_BASE_S)
#define SPI2_S                    ((SPI_TypeDef *) SPI2_BASE_S)
#define SPI3_S                    ((SPI_TypeDef *) SPI3_BASE_S)
#define SPI4_S                    ((SPI_TypeDef *) SPI4_BASE_S)
#define SPI5_S                    ((SPI_TypeDef *) SPI5_BASE_S)
#define SPI6_S                    ((SPI_TypeDef *) SPI6_BASE_S)
#define SYSCFG_S                  ((SYSCFG_TypeDef *) SYSCFG_BASE_S)
#define TAMP_S                    ((TAMP_TypeDef *) TAMP_BASE_S)
#define TIM1_S                    ((TIM_TypeDef *) TIM1_BASE_S)
#define TIM2_S                    ((TIM_TypeDef *) TIM2_BASE_S)
#define TIM3_S                    ((TIM_TypeDef *) TIM3_BASE_S)
#define TIM4_S                    ((TIM_TypeDef *) TIM4_BASE_S)
#define TIM5_S                    ((TIM_TypeDef *) TIM5_BASE_S)
#define TIM6_S                    ((TIM_TypeDef *) TIM6_BASE_S)
#define TIM7_S                    ((TIM_TypeDef *) TIM7_BASE_S)
#define TIM8_S                    ((TIM_TypeDef *) TIM8_BASE_S)
#define TIM9_S                    ((TIM_TypeDef *) TIM9_BASE_S)
#define TIM10_S                   ((TIM_TypeDef *) TIM10_BASE_S)
#define TIM11_S                   ((TIM_TypeDef *) TIM11_BASE_S)
#define TIM12_S                   ((TIM_TypeDef *) TIM12_BASE_S)
#define TIM13_S                   ((TIM_TypeDef *) TIM13_BASE_S)
#define TIM14_S                   ((TIM_TypeDef *) TIM14_BASE_S)
#define TIM15_S                   ((TIM_TypeDef *) TIM15_BASE_S)
#define TIM16_S                   ((TIM_TypeDef *) TIM16_BASE_S)
#define TIM17_S                   ((TIM_TypeDef *) TIM17_BASE_S)
#define TIM18_S                   ((TIM_TypeDef *) TIM18_BASE_S)
#define UART4_S                   ((USART_TypeDef *) UART4_BASE_S)
#define UART5_S                   ((USART_TypeDef *) UART5_BASE_S)
#define UART7_S                   ((USART_TypeDef *) UART7_BASE_S)
#define UART8_S                   ((USART_TypeDef *) UART8_BASE_S)
#define UART9_S                   ((USART_TypeDef *) UART9_BASE_S)
#define UCPD1_S                   ((UCPD_TypeDef *) UCPD1_BASE_S)
#define USART1_S                  ((USART_TypeDef *) USART1_BASE_S)
#define USART2_S                  ((USART_TypeDef *) USART2_BASE_S)
#define USART3_S                  ((USART_TypeDef *) USART3_BASE_S)
#define USART6_S                  ((USART_TypeDef *) USART6_BASE_S)
#define USART10_S                 ((USART_TypeDef *) USART10_BASE_S)
#define USB1_OTG_HS_S             ((USB_OTG_GlobalTypeDef *) USB1_OTG_HS_BASE_S)
#define USB2_OTG_HS_S             ((USB_OTG_GlobalTypeDef *) USB2_OTG_HS_BASE_S)
#define USB1_HS_PHYC_S            ((USB_HS_PHYC_GlobalTypeDef *) USB1_HS_PHYC_BASE_S)
#define USB2_HS_PHYC_S            ((USB_HS_PHYC_GlobalTypeDef *) USB2_HS_PHYC_BASE_S)
#define VENC_S                    ((VENC_TypeDef *) VENC_BASE_S)
#define VREFBUF_S                 ((VREFBUF_TypeDef *) VREFBUF_BASE_S)
#define WWDG_S                    ((WWDG_TypeDef *) WWDG_BASE_S)
#define XSPI1_S                   ((XSPI_TypeDef *) XSPI1_BASE_S)
#define XSPI2_S                   ((XSPI_TypeDef *) XSPI2_BASE_S)
#define XSPI3_S                   ((XSPI_TypeDef *) XSPI3_BASE_S)
#define XSPIM_S                   ((XSPIM_TypeDef *) XSPIM_BASE_S)
#endif

