micropython/micropython/lib/stm32n6/CMSIS/STM32N6xx/Include/stm32n655xx.h
/*!< Peripheral Instance aliases for Non-Secure/Secure execution  */
#if defined (CPU_IN_SECURE_STATE)
#define ADC12_COMMON              ADC12_COMMON_S
#define ADC12_COMMON_BASE         ADC12_COMMON_BASE_S

#define ADC1                      ADC1_S
#define ADC1_BASE                 ADC1_BASE_S

#define ADC2                      ADC2_S
#define ADC2_BASE                 ADC2_BASE_S

#define ADF1                      ADF1_S
#define ADF1_BASE                 ADF1_BASE_S

#define ADF1_Filter0              ADF1_Filter0_S
#define ADF1_Filter0_BASE         ADF1_Filter0_BASE_S

#define BSEC                      BSEC_S
#define BSEC_BASE                 BSEC_BASE_S

#define CRC                       CRC_S
#define CRC_BASE                  CRC_BASE_S

#define CRYP                      CRYP_S
#define CRYP_BASE                 CRYP_BASE_S

#define CSI                       CSI_S
#define CSI_BASE                  CSI_BASE_S

#define DBGMCU                    DBGMCU_S
#define DBGMCU_BASE               DBGMCU_BASE_S

#define DCMI                      DCMI_S
#define DCMI_BASE                 DCMI_BASE_S

#define DCMIPP                    DCMIPP_S
#define DCMIPP_BASE               DCMIPP_BASE_S

#define DLYB_SDMMC1               DLYB_SDMMC1_S
#define DLYB_SDMMC1_BASE          DLYB_SDMMC1_BASE_S

#define DLYB_SDMMC2               DLYB_SDMMC2_S
#define DLYB_SDMMC2_BASE          DLYB_SDMMC2_BASE_S

#define DMA2D                     DMA2D_S
#define DMA2D_BASE                DMA2D_BASE_S

#define DTS                       DTS_S
#define DTS_BASE                  DTS_BASE_S

#define DTS_Sensor0               DTS_Sensor0_S
#define DTS_Sensor0_BASE          DTS_Sensor0_BASE_S

#define DTS_Sensor1               DTS_Sensor1_S
#define DTS_Sensor1_BASE          DTS_Sensor1_BASE_S

#define ETH1                      ETH1_S
#define ETH1_BASE                 ETH1_BASE_S

#define EXTI                      EXTI_S
#define EXTI_BASE                 EXTI_BASE_S

#define FDCAN1                    FDCAN1_S
#define FDCAN1_BASE               FDCAN1_BASE_S

#define FDCAN2                    FDCAN2_S
#define FDCAN2_BASE               FDCAN2_BASE_S

#define FDCAN3                    FDCAN3_S
#define FDCAN3_BASE               FDCAN3_BASE_S

#define FDCAN_CCU                 FDCAN_CCU_S
#define FDCAN_CCU_BASE            FDCAN_CCU_BASE_S

#define FMC_R_BASE                FMC_R_BASE_S

#define FMC_Bank1E_R              FMC_Bank1E_R_S
#define FMC_Bank1E_R_BASE         FMC_Bank1E_R_BASE_S

#define FMC_Bank1_R               FMC_Bank1_R_S
#define FMC_Bank1_R_BASE          FMC_Bank1_R_BASE_S

#define FMC_Bank3_R               FMC_Bank3_R_S
#define FMC_Bank3_R_BASE          FMC_Bank3_R_BASE_S

#define FMC_Bank5_6_R             FMC_Bank5_6_R_S
#define FMC_Bank5_6_R_BASE        FMC_Bank5_6_R_BASE_S

#define FMC_Common_R              FMC_Common_R_S
#define FMC_Common_R_BASE         FMC_Common_R_BASE_S

#define GFXMMU                       GFXMMU_S
#define GFXMMU_BASE                  GFXMMU_BASE_S
#define GFXMMU_VIRTUAL_BUFFER0_BASE  GFXMMU_VIRTUAL_BUFFER0_BASE_S
#define GFXMMU_VIRTUAL_BUFFER1_BASE  GFXMMU_VIRTUAL_BUFFER1_BASE_S
#define GFXMMU_VIRTUAL_BUFFER2_BASE  GFXMMU_VIRTUAL_BUFFER2_BASE_S
#define GFXMMU_VIRTUAL_BUFFER3_BASE  GFXMMU_VIRTUAL_BUFFER3_BASE_S

#define GFXTIM                    GFXTIM_S
#define GFXTIM_BASE               GFXTIM_BASE_S

#define GPDMA1                    GPDMA1_S
#define GPDMA1_BASE               GPDMA1_BASE_S

#define GPDMA1_Channel0           GPDMA1_Channel0_S
#define GPDMA1_Channel0_BASE      GPDMA1_Channel0_BASE_S

#define GPDMA1_Channel1           GPDMA1_Channel1_S
#define GPDMA1_Channel1_BASE      GPDMA1_Channel1_BASE_S

#define GPDMA1_Channel2           GPDMA1_Channel2_S
#define GPDMA1_Channel2_BASE      GPDMA1_Channel2_BASE_S

#define GPDMA1_Channel3           GPDMA1_Channel3_S
#define GPDMA1_Channel3_BASE      GPDMA1_Channel3_BASE_S

#define GPDMA1_Channel4           GPDMA1_Channel4_S
#define GPDMA1_Channel4_BASE      GPDMA1_Channel4_BASE_S

#define GPDMA1_Channel5           GPDMA1_Channel5_S
#define GPDMA1_Channel5_BASE      GPDMA1_Channel5_BASE_S

#define GPDMA1_Channel6           GPDMA1_Channel6_S
#define GPDMA1_Channel6_BASE      GPDMA1_Channel6_BASE_S

#define GPDMA1_Channel7           GPDMA1_Channel7_S
#define GPDMA1_Channel7_BASE      GPDMA1_Channel7_BASE_S

#define GPDMA1_Channel8           GPDMA1_Channel8_S
#define GPDMA1_Channel8_BASE      GPDMA1_Channel8_BASE_S

#define GPDMA1_Channel9           GPDMA1_Channel9_S
#define GPDMA1_Channel9_BASE      GPDMA1_Channel9_BASE_S

#define GPDMA1_Channel10          GPDMA1_Channel10_S
#define GPDMA1_Channel10_BASE     GPDMA1_Channel10_BASE_S

#define GPDMA1_Channel11          GPDMA1_Channel11_S
#define GPDMA1_Channel11_BASE     GPDMA1_Channel11_BASE_S

#define GPDMA1_Channel12          GPDMA1_Channel12_S
#define GPDMA1_Channel12_BASE     GPDMA1_Channel12_BASE_S

#define GPDMA1_Channel13          GPDMA1_Channel13_S
#define GPDMA1_Channel13_BASE     GPDMA1_Channel13_BASE_S

#define GPDMA1_Channel14          GPDMA1_Channel14_S
#define GPDMA1_Channel14_BASE     GPDMA1_Channel14_BASE_S

#define GPDMA1_Channel15          GPDMA1_Channel15_S
#define GPDMA1_Channel15_BASE     GPDMA1_Channel15_BASE_S

#define GPIOA                     GPIOA_S
#define GPIOA_BASE                GPIOA_BASE_S

#define GPIOB                     GPIOB_S
#define GPIOB_BASE                GPIOB_BASE_S

#define GPIOC                     GPIOC_S
#define GPIOC_BASE                GPIOC_BASE_S

#define GPIOD                     GPIOD_S
#define GPIOD_BASE                GPIOD_BASE_S

#define GPIOE                     GPIOE_S
#define GPIOE_BASE                GPIOE_BASE_S

#define GPIOF                     GPIOF_S
#define GPIOF_BASE                GPIOF_BASE_S

#define GPIOG                     GPIOG_S
#define GPIOG_BASE                GPIOG_BASE_S

#define GPIOH                     GPIOH_S
#define GPIOH_BASE                GPIOH_BASE_S

#define GPION                     GPION_S
#define GPION_BASE                GPION_BASE_S

#define GPIOO                     GPIOO_S
#define GPIOO_BASE                GPIOO_BASE_S

