micropython/micropython/lib/stm32n6/CMSIS/STM32N6xx/Include/stm32n655xx.h
/*******************  Bits definition for IAC_ICR1 register *******************/
#define IAC_ICR1_IACF32_Pos           (0U)
#define IAC_ICR1_IACF32_Msk           (0x1UL << IAC_ICR1_IACF32_Pos)              /*!< 0x00000001 */
#define IAC_ICR1_IACF32               IAC_ICR1_IACF32_Msk
#define IAC_ICR1_IACF33_Pos           (1U)
#define IAC_ICR1_IACF33_Msk           (0x1UL << IAC_ICR1_IACF33_Pos)              /*!< 0x00000002 */
#define IAC_ICR1_IACF33               IAC_ICR1_IACF33_Msk
#define IAC_ICR1_IACF34_Pos           (2U)
#define IAC_ICR1_IACF34_Msk           (0x1UL << IAC_ICR1_IACF34_Pos)              /*!< 0x00000004 */
#define IAC_ICR1_IACF34               IAC_ICR1_IACF34_Msk
#define IAC_ICR1_IACF35_Pos           (3U)
#define IAC_ICR1_IACF35_Msk           (0x1UL << IAC_ICR1_IACF35_Pos)              /*!< 0x00000008 */
#define IAC_ICR1_IACF35               IAC_ICR1_IACF35_Msk
#define IAC_ICR1_IACF36_Pos           (4U)
#define IAC_ICR1_IACF36_Msk           (0x1UL << IAC_ICR1_IACF36_Pos)              /*!< 0x00000010 */
#define IAC_ICR1_IACF36               IAC_ICR1_IACF36_Msk
#define IAC_ICR1_IACF37_Pos           (5U)
#define IAC_ICR1_IACF37_Msk           (0x1UL << IAC_ICR1_IACF37_Pos)              /*!< 0x00000020 */
#define IAC_ICR1_IACF37               IAC_ICR1_IACF37_Msk
#define IAC_ICR1_IACF38_Pos           (6U)
#define IAC_ICR1_IACF38_Msk           (0x1UL << IAC_ICR1_IACF38_Pos)              /*!< 0x00000040 */
#define IAC_ICR1_IACF38               IAC_ICR1_IACF38_Msk
#define IAC_ICR1_IACF39_Pos           (7U)
#define IAC_ICR1_IACF39_Msk           (0x1UL << IAC_ICR1_IACF39_Pos)              /*!< 0x00000080 */
#define IAC_ICR1_IACF39               IAC_ICR1_IACF39_Msk
#define IAC_ICR1_IACF40_Pos           (8U)
#define IAC_ICR1_IACF40_Msk           (0x1UL << IAC_ICR1_IACF40_Pos)              /*!< 0x00000100 */
#define IAC_ICR1_IACF40               IAC_ICR1_IACF40_Msk
#define IAC_ICR1_IACF41_Pos           (9U)
#define IAC_ICR1_IACF41_Msk           (0x1UL << IAC_ICR1_IACF41_Pos)              /*!< 0x00000200 */
#define IAC_ICR1_IACF41               IAC_ICR1_IACF41_Msk
#define IAC_ICR1_IACF42_Pos           (10U)
#define IAC_ICR1_IACF42_Msk           (0x1UL << IAC_ICR1_IACF42_Pos)              /*!< 0x00000400 */
#define IAC_ICR1_IACF42               IAC_ICR1_IACF42_Msk
#define IAC_ICR1_IACF43_Pos           (11U)
#define IAC_ICR1_IACF43_Msk           (0x1UL << IAC_ICR1_IACF43_Pos)              /*!< 0x00000800 */
#define IAC_ICR1_IACF43               IAC_ICR1_IACF43_Msk
#define IAC_ICR1_IACF44_Pos           (12U)
#define IAC_ICR1_IACF44_Msk           (0x1UL << IAC_ICR1_IACF44_Pos)              /*!< 0x00001000 */
#define IAC_ICR1_IACF44               IAC_ICR1_IACF44_Msk
#define IAC_ICR1_IACF45_Pos           (13U)
#define IAC_ICR1_IACF45_Msk           (0x1UL << IAC_ICR1_IACF45_Pos)              /*!< 0x00002000 */
#define IAC_ICR1_IACF45               IAC_ICR1_IACF45_Msk
#define IAC_ICR1_IACF46_Pos           (14U)
#define IAC_ICR1_IACF46_Msk           (0x1UL << IAC_ICR1_IACF46_Pos)              /*!< 0x00004000 */
#define IAC_ICR1_IACF46               IAC_ICR1_IACF46_Msk
#define IAC_ICR1_IACF47_Pos           (15U)
#define IAC_ICR1_IACF47_Msk           (0x1UL << IAC_ICR1_IACF47_Pos)              /*!< 0x00008000 */
#define IAC_ICR1_IACF47               IAC_ICR1_IACF47_Msk
#define IAC_ICR1_IACF48_Pos           (16U)
#define IAC_ICR1_IACF48_Msk           (0x1UL << IAC_ICR1_IACF48_Pos)              /*!< 0x00010000 */
#define IAC_ICR1_IACF48               IAC_ICR1_IACF48_Msk
#define IAC_ICR1_IACF49_Pos           (17U)
#define IAC_ICR1_IACF49_Msk           (0x1UL << IAC_ICR1_IACF49_Pos)              /*!< 0x00020000 */
#define IAC_ICR1_IACF49               IAC_ICR1_IACF49_Msk
#define IAC_ICR1_IACF50_Pos           (18U)
#define IAC_ICR1_IACF50_Msk           (0x1UL << IAC_ICR1_IACF50_Pos)              /*!< 0x00040000 */
#define IAC_ICR1_IACF50               IAC_ICR1_IACF50_Msk
#define IAC_ICR1_IACF51_Pos           (19U)
#define IAC_ICR1_IACF51_Msk           (0x1UL << IAC_ICR1_IACF51_Pos)              /*!< 0x00080000 */
#define IAC_ICR1_IACF51               IAC_ICR1_IACF51_Msk
#define IAC_ICR1_IACF52_Pos           (20U)
#define IAC_ICR1_IACF52_Msk           (0x1UL << IAC_ICR1_IACF52_Pos)              /*!< 0x00100000 */
#define IAC_ICR1_IACF52               IAC_ICR1_IACF52_Msk
#define IAC_ICR1_IACF53_Pos           (21U)
#define IAC_ICR1_IACF53_Msk           (0x1UL << IAC_ICR1_IACF53_Pos)              /*!< 0x00200000 */
#define IAC_ICR1_IACF53               IAC_ICR1_IACF53_Msk
#define IAC_ICR1_IACF54_Pos           (22U)
#define IAC_ICR1_IACF54_Msk           (0x1UL << IAC_ICR1_IACF54_Pos)              /*!< 0x00400000 */
#define IAC_ICR1_IACF54               IAC_ICR1_IACF54_Msk
#define IAC_ICR1_IACF55_Pos           (23U)
#define IAC_ICR1_IACF55_Msk           (0x1UL << IAC_ICR1_IACF55_Pos)              /*!< 0x00800000 */
#define IAC_ICR1_IACF55               IAC_ICR1_IACF55_Msk
#define IAC_ICR1_IACF56_Pos           (24U)
#define IAC_ICR1_IACF56_Msk           (0x1UL << IAC_ICR1_IACF56_Pos)              /*!< 0x01000000 */
#define IAC_ICR1_IACF56               IAC_ICR1_IACF56_Msk
#define IAC_ICR1_IACF57_Pos           (25U)
#define IAC_ICR1_IACF57_Msk           (0x1UL << IAC_ICR1_IACF57_Pos)              /*!< 0x02000000 */
#define IAC_ICR1_IACF57               IAC_ICR1_IACF57_Msk
#define IAC_ICR1_IACF58_Pos           (26U)
#define IAC_ICR1_IACF58_Msk           (0x1UL << IAC_ICR1_IACF58_Pos)              /*!< 0x04000000 */
#define IAC_ICR1_IACF58               IAC_ICR1_IACF58_Msk
#define IAC_ICR1_IACF60_Pos           (28U)
#define IAC_ICR1_IACF60_Msk           (0x1UL << IAC_ICR1_IACF60_Pos)              /*!< 0x10000000 */
#define IAC_ICR1_IACF60               IAC_ICR1_IACF60_Msk
#define IAC_ICR1_IACF61_Pos           (29U)
#define IAC_ICR1_IACF61_Msk           (0x1UL << IAC_ICR1_IACF61_Pos)              /*!< 0x20000000 */
#define IAC_ICR1_IACF61               IAC_ICR1_IACF61_Msk
#define IAC_ICR1_IACF62_Pos           (30U)
#define IAC_ICR1_IACF62_Msk           (0x1UL << IAC_ICR1_IACF62_Pos)              /*!< 0x40000000 */
#define IAC_ICR1_IACF62               IAC_ICR1_IACF62_Msk

/*******************  Bits definition for IAC_ICR2 register *******************/
#define IAC_ICR2_IACF64_Pos           (0U)
#define IAC_ICR2_IACF64_Msk           (0x1UL << IAC_ICR2_IACF64_Pos)              /*!< 0x00000001 */
#define IAC_ICR2_IACF64               IAC_ICR2_IACF64_Msk
#define IAC_ICR2_IACF65_Pos           (1U)
#define IAC_ICR2_IACF65_Msk           (0x1UL << IAC_ICR2_IACF65_Pos)              /*!< 0x00000002 */
#define IAC_ICR2_IACF65               IAC_ICR2_IACF65_Msk
#define IAC_ICR2_IACF67_Pos           (3U)
#define IAC_ICR2_IACF67_Msk           (0x1UL << IAC_ICR2_IACF67_Pos)              /*!< 0x00000008 */
#define IAC_ICR2_IACF67               IAC_ICR2_IACF67_Msk
#define IAC_ICR2_IACF68_Pos           (4U)
#define IAC_ICR2_IACF68_Msk           (0x1UL << IAC_ICR2_IACF68_Pos)              /*!< 0x00000010 */
#define IAC_ICR2_IACF68               IAC_ICR2_IACF68_Msk
#define IAC_ICR2_IACF69_Pos           (5U)
#define IAC_ICR2_IACF69_Msk           (0x1UL << IAC_ICR2_IACF69_Pos)              /*!< 0x00000020 */
#define IAC_ICR2_IACF69               IAC_ICR2_IACF69_Msk
#define IAC_ICR2_IACF76_Pos           (12U)
#define IAC_ICR2_IACF76_Msk           (0x1UL << IAC_ICR2_IACF76_Pos)              /*!< 0x00001000 */
#define IAC_ICR2_IACF76               IAC_ICR2_IACF76_Msk
#define IAC_ICR2_IACF77_Pos           (13U)
#define IAC_ICR2_IACF77_Msk           (0x1UL << IAC_ICR2_IACF77_Pos)              /*!< 0x00002000 */
#define IAC_ICR2_IACF77               IAC_ICR2_IACF77_Msk
#define IAC_ICR2_IACF78_Pos           (14U)
#define IAC_ICR2_IACF78_Msk           (0x1UL << IAC_ICR2_IACF78_Pos)              /*!< 0x00004000 */
#define IAC_ICR2_IACF78               IAC_ICR2_IACF78_Msk
#define IAC_ICR2_IACF79_Pos           (15U)
#define IAC_ICR2_IACF79_Msk           (0x1UL << IAC_ICR2_IACF79_Pos)              /*!< 0x00008000 */
#define IAC_ICR2_IACF79               IAC_ICR2_IACF79_Msk
#define IAC_ICR2_IACF80_Pos           (16U)
#define IAC_ICR2_IACF80_Msk           (0x1UL << IAC_ICR2_IACF80_Pos)              /*!< 0x00010000 */
#define IAC_ICR2_IACF80               IAC_ICR2_IACF80_Msk
#define IAC_ICR2_IACF81_Pos           (17U)
#define IAC_ICR2_IACF81_Msk           (0x1UL << IAC_ICR2_IACF81_Pos)              /*!< 0x00020000 */
#define IAC_ICR2_IACF81               IAC_ICR2_IACF81_Msk
#define IAC_ICR2_IACF82_Pos           (18U)
#define IAC_ICR2_IACF82_Msk           (0x1UL << IAC_ICR2_IACF82_Pos)              /*!< 0x00040000 */
#define IAC_ICR2_IACF82               IAC_ICR2_IACF82_Msk
#define IAC_ICR2_IACF83_Pos           (19U)
#define IAC_ICR2_IACF83_Msk           (0x1UL << IAC_ICR2_IACF83_Pos)              /*!< 0x00080000 */
#define IAC_ICR2_IACF83               IAC_ICR2_IACF83_Msk
#define IAC_ICR2_IACF84_Pos           (20U)
#define IAC_ICR2_IACF84_Msk           (0x1UL << IAC_ICR2_IACF84_Pos)              /*!< 0x00100000 */
#define IAC_ICR2_IACF84               IAC_ICR2_IACF84_Msk
#define IAC_ICR2_IACF86_Pos           (22U)
#define IAC_ICR2_IACF86_Msk           (0x1UL << IAC_ICR2_IACF86_Pos)              /*!< 0x00400000 */
#define IAC_ICR2_IACF86               IAC_ICR2_IACF86_Msk
#define IAC_ICR2_IACF87_Pos           (23U)
#define IAC_ICR2_IACF87_Msk           (0x1UL << IAC_ICR2_IACF87_Pos)              /*!< 0x00800000 */
#define IAC_ICR2_IACF87               IAC_ICR2_IACF87_Msk
#define IAC_ICR2_IACF88_Pos           (24U)
#define IAC_ICR2_IACF88_Msk           (0x1UL << IAC_ICR2_IACF88_Pos)              /*!< 0x01000000 */
#define IAC_ICR2_IACF88               IAC_ICR2_IACF88_Msk
#define IAC_ICR2_IACF89_Pos           (25U)
#define IAC_ICR2_IACF89_Msk           (0x1UL << IAC_ICR2_IACF89_Pos)              /*!< 0x02000000 */
#define IAC_ICR2_IACF89               IAC_ICR2_IACF89_Msk
#define IAC_ICR2_IACF90_Pos           (26U)
#define IAC_ICR2_IACF90_Msk           (0x1UL << IAC_ICR2_IACF90_Pos)              /*!< 0x04000000 */
#define IAC_ICR2_IACF90               IAC_ICR2_IACF90_Msk
#define IAC_ICR2_IACF92_Pos           (28U)
#define IAC_ICR2_IACF92_Msk           (0x1UL << IAC_ICR2_IACF92_Pos)              /*!< 0x10000000 */
#define IAC_ICR2_IACF92               IAC_ICR2_IACF92_Msk
#define IAC_ICR2_IACF93_Pos           (29U)
#define IAC_ICR2_IACF93_Msk           (0x1UL << IAC_ICR2_IACF93_Pos)              /*!< 0x20000000 */
#define IAC_ICR2_IACF93               IAC_ICR2_IACF93_Msk
#define IAC_ICR2_IACF94_Pos           (30U)
#define IAC_ICR2_IACF94_Msk           (0x1UL << IAC_ICR2_IACF94_Pos)              /*!< 0x40000000 */
#define IAC_ICR2_IACF94               IAC_ICR2_IACF94_Msk
#define IAC_ICR2_IACF95_Pos           (31U)
#define IAC_ICR2_IACF95_Msk           (0x1UL << IAC_ICR2_IACF95_Pos)              /*!< 0x80000000 */
#define IAC_ICR2_IACF95               IAC_ICR2_IACF95_Msk

/*******************  Bits definition for IAC_ICR3 register *******************/
#define IAC_ICR3_IACF96_Pos           (0U)
#define IAC_ICR3_IACF96_Msk           (0x1UL << IAC_ICR3_IACF96_Pos)              /*!< 0x00000001 */
#define IAC_ICR3_IACF96               IAC_ICR3_IACF96_Msk
#define IAC_ICR3_IACF97_Pos           (1U)
#define IAC_ICR3_IACF97_Msk           (0x1UL << IAC_ICR3_IACF97_Pos)              /*!< 0x00000002 */
#define IAC_ICR3_IACF97               IAC_ICR3_IACF97_Msk
#define IAC_ICR3_IACF98_Pos           (2U)
#define IAC_ICR3_IACF98_Msk           (0x1UL << IAC_ICR3_IACF98_Pos)              /*!< 0x00000004 */
#define IAC_ICR3_IACF98               IAC_ICR3_IACF98_Msk
#define IAC_ICR3_IACF99_Pos           (3U)
#define IAC_ICR3_IACF99_Msk           (0x1UL << IAC_ICR3_IACF99_Pos)              /*!< 0x00000008 */
#define IAC_ICR3_IACF99               IAC_ICR3_IACF99_Msk
#define IAC_ICR3_IACF100_Pos          (4U)
#define IAC_ICR3_IACF100_Msk          (0x1UL << IAC_ICR3_IACF100_Pos)             /*!< 0x00000010 */
#define IAC_ICR3_IACF100              IAC_ICR3_IACF100_Msk
#define IAC_ICR3_IACF101_Pos          (5U)
#define IAC_ICR3_IACF101_Msk          (0x1UL << IAC_ICR3_IACF101_Pos)             /*!< 0x00000020 */
#define IAC_ICR3_IACF101              IAC_ICR3_IACF101_Msk
#define IAC_ICR3_IACF102_Pos          (6U)
#define IAC_ICR3_IACF102_Msk          (0x1UL << IAC_ICR3_IACF102_Pos)             /*!< 0x00000040 */
#define IAC_ICR3_IACF102              IAC_ICR3_IACF102_Msk
#define IAC_ICR3_IACF103_Pos          (7U)
#define IAC_ICR3_IACF103_Msk          (0x1UL << IAC_ICR3_IACF103_Pos)             /*!< 0x00000080 */
#define IAC_ICR3_IACF103              IAC_ICR3_IACF103_Msk
#define IAC_ICR3_IACF104_Pos          (8U)
#define IAC_ICR3_IACF104_Msk          (0x1UL << IAC_ICR3_IACF104_Pos)             /*!< 0x00000100 */
#define IAC_ICR3_IACF104              IAC_ICR3_IACF104_Msk
#define IAC_ICR3_IACF106_Pos          (10U)
#define IAC_ICR3_IACF106_Msk          (0x1UL << IAC_ICR3_IACF106_Pos)             /*!< 0x00000400 */
#define IAC_ICR3_IACF106              IAC_ICR3_IACF106_Msk

/*******************  Bits definition for IAC_ICR4 register *******************/
#define IAC_ICR4_IACF128_Pos          (0U)
#define IAC_ICR4_IACF128_Msk          (0x1UL << IAC_ICR4_IACF128_Pos)             /*!< 0x00000001 */
#define IAC_ICR4_IACF128              IAC_ICR4_IACF128_Msk
#define IAC_ICR4_IACF129_Pos          (1U)
#define IAC_ICR4_IACF129_Msk          (0x1UL << IAC_ICR4_IACF129_Pos)             /*!< 0x00000002 */
#define IAC_ICR4_IACF129              IAC_ICR4_IACF129_Msk
#define IAC_ICR4_IACF130_Pos          (2U)
#define IAC_ICR4_IACF130_Msk          (0x1UL << IAC_ICR4_IACF130_Pos)             /*!< 0x00000004 */
#define IAC_ICR4_IACF130              IAC_ICR4_IACF130_Msk
#define IAC_ICR4_IACF131_Pos          (3U)
#define IAC_ICR4_IACF131_Msk          (0x1UL << IAC_ICR4_IACF131_Pos)             /*!< 0x00000008 */
#define IAC_ICR4_IACF131              IAC_ICR4_IACF131_Msk
#define IAC_ICR4_IACF133_Pos          (5U)
#define IAC_ICR4_IACF133_Msk          (0x1UL << IAC_ICR4_IACF133_Pos)             /*!< 0x00000020 */
#define IAC_ICR4_IACF133              IAC_ICR4_IACF133_Msk
#define IAC_ICR4_IACF134_Pos          (6U)
#define IAC_ICR4_IACF134_Msk          (0x1UL << IAC_ICR4_IACF134_Pos)             /*!< 0x00000040 */
#define IAC_ICR4_IACF134              IAC_ICR4_IACF134_Msk
#define IAC_ICR4_IACF135_Pos          (7U)
#define IAC_ICR4_IACF135_Msk          (0x1UL << IAC_ICR4_IACF135_Pos)             /*!< 0x00000080 */
#define IAC_ICR4_IACF135              IAC_ICR4_IACF135_Msk
#define IAC_ICR4_IACF136_Pos          (8U)
#define IAC_ICR4_IACF136_Msk          (0x1UL << IAC_ICR4_IACF136_Pos)             /*!< 0x00000100 */
#define IAC_ICR4_IACF136              IAC_ICR4_IACF136_Msk
#define IAC_ICR4_IACF137_Pos          (9U)
#define IAC_ICR4_IACF137_Msk          (0x1UL << IAC_ICR4_IACF137_Pos)             /*!< 0x00000200 */
#define IAC_ICR4_IACF137              IAC_ICR4_IACF137_Msk
#define IAC_ICR4_IACF138_Pos          (10U)
#define IAC_ICR4_IACF138_Msk          (0x1UL << IAC_ICR4_IACF138_Pos)             /*!< 0x00000400 */
#define IAC_ICR4_IACF138              IAC_ICR4_IACF138_Msk
#define IAC_ICR4_IACF139_Pos          (11U)
#define IAC_ICR4_IACF139_Msk          (0x1UL << IAC_ICR4_IACF139_Pos)             /*!< 0x00000800 */
#define IAC_ICR4_IACF139              IAC_ICR4_IACF139_Msk
#define IAC_ICR4_IACF140_Pos          (12U)
#define IAC_ICR4_IACF140_Msk          (0x1UL << IAC_ICR4_IACF140_Pos)             /*!< 0x00001000 */
#define IAC_ICR4_IACF140              IAC_ICR4_IACF140_Msk
#define IAC_ICR4_IACF141_Pos          (13U)
#define IAC_ICR4_IACF141_Msk          (0x1UL << IAC_ICR4_IACF141_Pos)             /*!< 0x00002000 */
#define IAC_ICR4_IACF141              IAC_ICR4_IACF141_Msk
#define IAC_ICR4_IACF142_Pos          (14U)
#define IAC_ICR4_IACF142_Msk          (0x1UL << IAC_ICR4_IACF142_Pos)             /*!< 0x00004000 */
#define IAC_ICR4_IACF142              IAC_ICR4_IACF142_Msk
#define IAC_ICR4_IACF143_Pos          (15U)
#define IAC_ICR4_IACF143_Msk          (0x1UL << IAC_ICR4_IACF143_Pos)             /*!< 0x00008000 */
#define IAC_ICR4_IACF143              IAC_ICR4_IACF143_Msk
#define IAC_ICR4_IACF144_Pos          (16U)
#define IAC_ICR4_IACF144_Msk          (0x1UL << IAC_ICR4_IACF144_Pos)             /*!< 0x00010000 */
#define IAC_ICR4_IACF144              IAC_ICR4_IACF144_Msk
#define IAC_ICR4_IACF145_Pos          (17U)
#define IAC_ICR4_IACF145_Msk          (0x1UL << IAC_ICR4_IACF145_Pos)             /*!< 0x00020000 */
#define IAC_ICR4_IACF145              IAC_ICR4_IACF145_Msk
#define IAC_ICR4_IACF146_Pos          (18U)
#define IAC_ICR4_IACF146_Msk          (0x1UL << IAC_ICR4_IACF146_Pos)             /*!< 0x00040000 */
#define IAC_ICR4_IACF146              IAC_ICR4_IACF146_Msk
#define IAC_ICR4_IACF147_Pos          (19U)
#define IAC_ICR4_IACF147_Msk          (0x1UL << IAC_ICR4_IACF147_Pos)             /*!< 0x00080000 */
#define IAC_ICR4_IACF147              IAC_ICR4_IACF147_Msk
#define IAC_ICR4_IACF149_Pos          (21U)
#define IAC_ICR4_IACF149_Msk          (0x1UL << IAC_ICR4_IACF149_Pos)             /*!< 0x00200000 */
#define IAC_ICR4_IACF149              IAC_ICR4_IACF149_Msk
#define IAC_ICR4_IACF150_Pos          (22U)
#define IAC_ICR4_IACF150_Msk          (0x1UL << IAC_ICR4_IACF150_Pos)             /*!< 0x00400000 */
#define IAC_ICR4_IACF150              IAC_ICR4_IACF150_Msk
#define IAC_ICR4_IACF151_Pos          (23U)
#define IAC_ICR4_IACF151_Msk          (0x1UL << IAC_ICR4_IACF151_Pos)             /*!< 0x00800000 */
#define IAC_ICR4_IACF151              IAC_ICR4_IACF151_Msk
#define IAC_ICR4_IACF152_Pos          (24U)
#define IAC_ICR4_IACF152_Msk          (0x1UL << IAC_ICR4_IACF152_Pos)             /*!< 0x01000000 */
#define IAC_ICR4_IACF152              IAC_ICR4_IACF152_Msk
#define IAC_ICR4_IACF153_Pos          (25U)
#define IAC_ICR4_IACF153_Msk          (0x1UL << IAC_ICR4_IACF153_Pos)             /*!< 0x02000000 */
#define IAC_ICR4_IACF153              IAC_ICR4_IACF153_Msk
#define IAC_ICR4_IACF155_Pos          (27U)
#define IAC_ICR4_IACF155_Msk          (0x1UL << IAC_ICR4_IACF155_Pos)             /*!< 0x08000000 */
#define IAC_ICR4_IACF155              IAC_ICR4_IACF155_Msk
#define IAC_ICR4_IACF156_Pos          (28U)
#define IAC_ICR4_IACF156_Msk          (0x1UL << IAC_ICR4_IACF156_Pos)             /*!< 0x10000000 */
#define IAC_ICR4_IACF156              IAC_ICR4_IACF156_Msk
#define IAC_ICR4_IACF157_Pos          (29U)
#define IAC_ICR4_IACF157_Msk          (0x1UL << IAC_ICR4_IACF157_Pos)             /*!< 0x20000000 */
#define IAC_ICR4_IACF157              IAC_ICR4_IACF157_Msk


/******************************************************************************/
/*                                                                            */
/*                                 ICACHE                                     */
/*                                                                            */
/******************************************************************************/
/******************  Bit definition for ICACHE_CR register  *******************/
#define ICACHE_CR_EN_Pos               (0U)
#define ICACHE_CR_EN_Msk               (0x1UL << ICACHE_CR_EN_Pos)             /*!< 0x00000001 */
#define ICACHE_CR_EN                   ICACHE_CR_EN_Msk                        /*!< Enable */
#define ICACHE_CR_CACHEINV_Pos         (1U)
#define ICACHE_CR_CACHEINV_Msk         (0x1UL << ICACHE_CR_CACHEINV_Pos)       /*!< 0x00000002 */
#define ICACHE_CR_CACHEINV             ICACHE_CR_CACHEINV_Msk                  /*!< Cache invalidation */
#define ICACHE_CR_WAYSEL_Pos           (2U)
#define ICACHE_CR_WAYSEL_Msk           (0x1UL << ICACHE_CR_WAYSEL_Pos)         /*!< 0x00000004 */
#define ICACHE_CR_WAYSEL               ICACHE_CR_WAYSEL_Msk                    /*!< Ways selection */
#define ICACHE_CR_HITMEN_Pos           (16U)
#define ICACHE_CR_HITMEN_Msk           (0x1UL << ICACHE_CR_HITMEN_Pos)         /*!< 0x00010000 */
#define ICACHE_CR_HITMEN               ICACHE_CR_HITMEN_Msk                    /*!< Hit monitor enable */
#define ICACHE_CR_MISSMEN_Pos          (17U)
#define ICACHE_CR_MISSMEN_Msk          (0x1UL << ICACHE_CR_MISSMEN_Pos)        /*!< 0x00020000 */
#define ICACHE_CR_MISSMEN              ICACHE_CR_MISSMEN_Msk                   /*!< Miss monitor enable */
#define ICACHE_CR_HITMRST_Pos          (18U)
#define ICACHE_CR_HITMRST_Msk          (0x1UL << ICACHE_CR_HITMRST_Pos)        /*!< 0x00040000 */
#define ICACHE_CR_HITMRST              ICACHE_CR_HITMRST_Msk                   /*!< Hit monitor reset */
#define ICACHE_CR_MISSMRST_Pos         (19U)
#define ICACHE_CR_MISSMRST_Msk         (0x1UL << ICACHE_CR_MISSMRST_Pos)       /*!< 0x00080000 */
#define ICACHE_CR_MISSMRST             ICACHE_CR_MISSMRST_Msk                  /*!< Miss monitor reset */

/******************  Bit definition for ICACHE_SR register  *******************/
#define ICACHE_SR_BUSYF_Pos            (0U)
#define ICACHE_SR_BUSYF_Msk            (0x1UL << ICACHE_SR_BUSYF_Pos)          /*!< 0x00000001 */
#define ICACHE_SR_BUSYF                ICACHE_SR_BUSYF_Msk                     /*!< Busy flag */
#define ICACHE_SR_BSYENDF_Pos          (1U)
#define ICACHE_SR_BSYENDF_Msk          (0x1UL << ICACHE_SR_BSYENDF_Pos)        /*!< 0x00000002 */
#define ICACHE_SR_BSYENDF              ICACHE_SR_BSYENDF_Msk                   /*!< Busy end flag */
#define ICACHE_SR_ERRF_Pos             (2U)
#define ICACHE_SR_ERRF_Msk             (0x1UL << ICACHE_SR_ERRF_Pos)           /*!< 0x00000004 */
#define ICACHE_SR_ERRF                 ICACHE_SR_ERRF_Msk                      /*!< Cache error flag */

