micropython/micropython/lib/stm32n6/CMSIS/STM32N6xx/Include/stm32n655xx.h
/********************  Bit definition for MCE_SADDR register  *****************/
#define MCE_SADDR_BADDSTART_Pos        (12U)
#define MCE_SADDR_BADDSTART_Msk        (0xFFFFFUL << MCE_SADDR_BADDSTART_Pos)   /*!< 0xFFFFF000 */
#define MCE_SADDR_BADDSTART            MCE_SADDR_BADDSTART_Msk                  /*!< MCE region address start */

/********************  Bit definition for MCE_EADDR register  *****************/
#define MCE_EADDR_BADDEND_Pos          (12U)
#define MCE_EADDR_BADDEND_Msk          (0xFFFFFUL << MCE_EADDR_BADDEND_Pos)     /*!< 0xFFFFF000 */
#define MCE_EADDR_BADDEND              MCE_EADDR_BADDEND_Msk                    /*!< MCE region address end */

/********************  Bit definition for MCE_MKEYR0 register  ****************/
#define MCE_MKEYR0_MKEY_Pos            (0U)
#define MCE_MKEYR0_MKEY_Msk            (0xFFFFFFFFUL << MCE_MKEYR0_MKEY_Pos)    /*!< 0xFFFFFFFF */
#define MCE_MKEYR0_MKEY                MCE_MKEYR0_MKEY_Msk                      /*!< MCE master key, bits [31:0] */

/********************  Bit definition for MCE_MKEYR1 register  ****************/
#define MCE_MKEYR1_MKEY_Pos            (0U)
#define MCE_MKEYR1_MKEY_Msk            (0xFFFFFFFFUL << MCE_MKEYR1_MKEY_Pos)    /*!< 0xFFFFFFFF */
#define MCE_MKEYR1_MKEY                MCE_MKEYR1_MKEY_Msk                      /*!< MCE master key, bits [63:32] */

/********************  Bit definition for MCE_MKEYR2 register  ****************/
#define MCE_MKEYR2_MKEY_Pos            (0U)
#define MCE_MKEYR2_MKEY_Msk            (0xFFFFFFFFUL << MCE_MKEYR2_MKEY_Pos)    /*!< 0xFFFFFFFF */
#define MCE_MKEYR2_MKEY                MCE_MKEYR2_MKEY_Msk                      /*!< MCE master key, bits [95:64] */

/********************  Bit definition for MCE_MKEYR3 register  ****************/
#define MCE_MKEYR3_MKEY_Pos            (0U)
#define MCE_MKEYR3_MKEY_Msk            (0xFFFFFFFFUL << MCE_MKEYR3_MKEY_Pos)    /*!< 0xFFFFFFFF */
#define MCE_MKEYR3_MKEY                MCE_MKEYR3_MKEY_Msk                      /*!< MCE master key, bits [127:96] */

/********************  Bit definition for MCE_MKEYR4 register  ****************/
#define MCE_MKEYR4_MKEY_Pos            (0U)
#define MCE_MKEYR4_MKEY_Msk            (0xFFFFFFFFUL << MCE_MKEYR4_MKEY_Pos)    /*!< 0xFFFFFFFF */
#define MCE_MKEYR4_MKEY                MCE_MKEYR4_MKEY_Msk                      /*!< MCE master key, bits [159:128] */

/********************  Bit definition for MCE_MKEYR5 register  ****************/
#define MCE_MKEYR5_MKEY_Pos            (0U)
#define MCE_MKEYR5_MKEY_Msk            (0xFFFFFFFFUL << MCE_MKEYR5_MKEY_Pos)    /*!< 0xFFFFFFFF */
#define MCE_MKEYR5_MKEY                MCE_MKEYR5_MKEY_Msk                      /*!< MCE master key, bits [191:160] */

/********************  Bit definition for MCE_MKEYR6 register  ****************/
#define MCE_MKEYR6_MKEY_Pos            (0U)
#define MCE_MKEYR6_MKEY_Msk            (0xFFFFFFFFUL << MCE_MKEYR6_MKEY_Pos)    /*!< 0xFFFFFFFF */
#define MCE_MKEYR6_MKEY                MCE_MKEYR6_MKEY_Msk                      /*!< MCE master key, bits [223:192] */

/********************  Bit definition for MCE_MKEYR7 register  ****************/
#define MCE_MKEYR7_MKEY_Pos            (0U)
#define MCE_MKEYR7_MKEY_Msk            (0xFFFFFFFFUL << MCE_MKEYR7_MKEY_Pos)    /*!< 0xFFFFFFFF */
#define MCE_MKEYR7_MKEY                MCE_MKEYR7_MKEY_Msk                      /*!< MCE master key, bits [255:224] */

/********************  Bit definition for MCE_FMKEYR0 register  ***************/
#define MCE_FMKEYR0_FMKEY_Pos          (0U)
#define MCE_FMKEYR0_FMKEY_Msk          (0xFFFFFFFFUL << MCE_FMKEYR0_FMKEY_Pos)  /*!< 0xFFFFFFFF */
#define MCE_FMKEYR0_FMKEY              MCE_FMKEYR0_FMKEY_Msk                    /*!< MCE fast master key, bits [31:0] */

/********************  Bit definition for MCE_FMKEYR1 register  ***************/
#define MCE_FMKEYR1_FMKEY_Pos          (0U)
#define MCE_FMKEYR1_FMKEY_Msk          (0xFFFFFFFFUL << MCE_FMKEYR1_FMKEY_Pos)  /*!< 0xFFFFFFFF */
#define MCE_FMKEYR1_FMKEY              MCE_FMKEYR1_FMKEY_Msk                    /*!< MCE fast master key, bits [63:32] */

/********************  Bit definition for MCE_FMKEYR2 register  ***************/
#define MCE_FMKEYR2_FMKEY_Pos          (0U)
#define MCE_FMKEYR2_FMKEY_Msk          (0xFFFFFFFFUL << MCE_FMKEYR2_FMKEY_Pos)  /*!< 0xFFFFFFFF */
#define MCE_FMKEYR2_FMKEY              MCE_FMKEYR2_FMKEY_Msk                    /*!< MCE fast master key, bits [95:64] */

/********************  Bit definition for MCE_FMKEYR3 register  ***************/
#define MCE_FMKEYR3_FMKEY_Pos          (0U)
#define MCE_FMKEYR3_FMKEY_Msk          (0xFFFFFFFFUL << MCE_FMKEYR3_FMKEY_Pos)  /*!< 0xFFFFFFFF */
#define MCE_FMKEYR3_FMKEY              MCE_FMKEYR3_FMKEY_Msk                    /*!< MCE fast master key, bits [127:96] */

/********************  Bit definition for MCE_FMKEYR4 register  ****************/
#define MCE_FMKEYR4_FMKEY_Pos          (0U)
#define MCE_FMKEYR4_FMKEY_Msk          (0xFFFFFFFFUL << MCE_FMKEYR4_FMKEY_Pos)  /*!< 0xFFFFFFFF */
#define MCE_FMKEYR4_FMKEY              MCE_FMKEYR4_FMKEY_Msk                    /*!< MCE fast master key, bits [159:128] */

/********************  Bit definition for MCE_FMKEYR5 register  ****************/
#define MCE_FMKEYR5_FMKEY_Pos          (0U)
#define MCE_FMKEYR5_FMKEY_Msk          (0xFFFFFFFFUL << MCE_FMKEYR5_FMKEY_Pos)  /*!< 0xFFFFFFFF */
#define MCE_FMKEYR5_FMKEY              MCE_FMKEYR5_FMKEY_Msk                    /*!< MCE fast master key, bits [191:160] */

/********************  Bit definition for MCE_FMKEYR6 register  ****************/
#define MCE_FMKEYR6_FMKEY_Pos          (0U)
#define MCE_FMKEYR6_FMKEY_Msk          (0xFFFFFFFFUL << MCE_FMKEYR6_FMKEY_Pos)  /*!< 0xFFFFFFFF */
#define MCE_FMKEYR6_FMKEY              MCE_FMKEYR6_FMKEY_Msk                    /*!< MCE fast master key, bits [223:192] */

/********************  Bit definition for MCE_FMKEYR7 register  ****************/
#define MCE_FMKEYR7_FMKEY_Pos          (0U)
#define MCE_FMKEYR7_FMKEY_Msk          (0xFFFFFFFFUL << MCE_FMKEYR7_FMKEY_Pos)  /*!< 0xFFFFFFFF */
#define MCE_FMKEYR7_FMKEY              MCE_FMKEYR7_FMKEY_Msk                    /*!< MCE fast master key, bits [255:224] */

/********************  Bit definition for MCE_CCCFGR register  ****************/
#define MCE_CCCFGR_CCEN_Pos             (0U)
#define MCE_CCCFGR_CCEN_Msk             (0x1UL << MCE_CCCFGR_CCEN_Pos)          /*!< 0x00000001 */
#define MCE_CCCFGR_CCEN                 MCE_CCCFGR_CCEN_Msk                     /*!< MCE cipher context enable */
#define MCE_CCCFGR_CCLOCK_Pos           (1U)
#define MCE_CCCFGR_CCLOCK_Msk           (0x1UL << MCE_CCCFGR_CCLOCK_Pos)        /*!< 0x00000002 */
#define MCE_CCCFGR_CCLOCK               MCE_CCCFGR_CCLOCK_Msk                   /*!< MCE cipher context lock */
#define MCE_CCCFGR_KEYLOCK_Pos          (2U)
#define MCE_CCCFGR_KEYLOCK_Msk          (0x1UL << MCE_CCCFGR_KEYLOCK_Pos)       /*!< 0x00000004 */
#define MCE_CCCFGR_KEYLOCK              MCE_CCCFGR_KEYLOCK_Msk                  /*!< MCE cipher context key lock */
#define MCE_CCCFGR_MODE_Pos             (4U)
#define MCE_CCCFGR_MODE_Msk             (0x3UL << MCE_CCCFGR_MODE_Pos)          /*!< 0x00000030 */
#define MCE_CCCFGR_MODE                 MCE_CCCFGR_MODE_Msk                     /*!< MCE authorized cipher mode */
#define MCE_CCCFGR_MODE_0               (0x1UL << MCE_CCCFGR_MODE_Pos)          /*!< 0x00000010 */
#define MCE_CCCFGR_MODE_1               (0x2UL << MCE_CCCFGR_MODE_Pos)          /*!< 0x00000020 */
#define MCE_CCCFGR_KEYCRC_Pos           (8U)
#define MCE_CCCFGR_KEYCRC_Msk           (0xFFUL << MCE_CCCFGR_KEYCRC_Pos)       /*!< 0x0000FF00 */
#define MCE_CCCFGR_KEYCRC               MCE_CCCFGR_KEYCRC_Msk                   /*!< MCE cipher context key CRC */
#define MCE_CCCFGR_VERSION_Pos          (16U)
#define MCE_CCCFGR_VERSION_Msk          (0xFFFFUL << MCE_CCCFGR_VERSION_Pos)    /*!< 0xFFFF0000 */
#define MCE_CCCFGR_VERSION              MCE_CCCFGR_VERSION_Msk                  /*!< MCE cipher context version */

/********************  Bit definition for MCE_CCNR0 register  *****************/
#define MCE_CCNR0_SCNONCE_Pos          (0U)
#define MCE_CCNR0_SCNONCE_Msk          (0xFFFFFFFFUL << MCE_CCNR0_SCNONCE_Pos)  /*!< 0xFFFFFFFF */
#define MCE_CCNR0_SCNONCE              MCE_CCNR0_SCNONCE_Msk                    /*!< MCE cipher context stream cipher nonce, bits [31:0] */

