micropython/micropython/lib/stm32n6/CMSIS/STM32N6xx/Include/stm32n655xx.h
#define IS_SPI_FULL_INSTANCE(INSTANCE) (((INSTANCE) == SPI1_S) || ((INSTANCE) == SPI1_NS) || \
                                        ((INSTANCE) == SPI2_S) || ((INSTANCE) == SPI2_NS) || \
                                        ((INSTANCE) == SPI3_S) || ((INSTANCE) == SPI3_NS) || \
                                        ((INSTANCE) == SPI6_S) || ((INSTANCE) == SPI6_NS))

#define IS_SPI_LIMITED_INSTANCE(INSTANCE) (((INSTANCE) == SPI4_S) || ((INSTANCE) == SPI4_NS) || \
                                           ((INSTANCE) == SPI5_S) || ((INSTANCE) == SPI5_NS))

/******************************** I2S Instances ******************************/
#define IS_I2S_ALL_INSTANCE(INSTANCE) (((INSTANCE) == SPI1_S) || ((INSTANCE) == SPI1_NS) || \
                                       ((INSTANCE) == SPI2_S) || ((INSTANCE) == SPI2_NS) || \
                                       ((INSTANCE) == SPI3_S) || ((INSTANCE) == SPI3_NS) || \
                                       ((INSTANCE) == SPI6_S) || ((INSTANCE) == SPI6_NS))

/****************************** UCPD Instances *******************************/
#define IS_UCPD_ALL_INSTANCE(INSTANCE) (((INSTANCE) == UCPD1_S) || ((INSTANCE) == UCPD1_NS))

/******************************* OTG HS HCD Instances *************************/
#define IS_HCD_ALL_INSTANCE(INSTANCE) (((INSTANCE) == USB1_OTG_HS_S) || ((INSTANCE) == USB1_OTG_HS_NS) || \
                                       ((INSTANCE) == USB2_OTG_HS_S) || ((INSTANCE) == USB2_OTG_HS_NS))

/******************************* OTG HS PCD Instances *************************/
#define IS_PCD_ALL_INSTANCE(INSTANCE) (((INSTANCE) == USB1_OTG_HS_S) || ((INSTANCE) == USB1_OTG_HS_NS) || \
                                       ((INSTANCE) == USB2_OTG_HS_S) || ((INSTANCE) == USB2_OTG_HS_NS))

/******************************* USB HS PHY Instances *************************/
#define IS_USBPHYC_ALL_INSTANCE(INSTANCE) (((INSTANCE) == USB1_HS_PHYC_S) || ((INSTANCE) == USB1_HS_PHYC_NS) || \
                                           ((INSTANCE) == USB2_HS_PHYC_S) || ((INSTANCE) == USB2_HS_PHYC_NS))

/******************** USART Instances : Synchronous mode *********************/
#define IS_USART_INSTANCE(INSTANCE) (((INSTANCE) == USART1_S)  || ((INSTANCE) == USART1_NS) || \
                                     ((INSTANCE) == USART2_S)  || ((INSTANCE) == USART2_NS) || \
                                     ((INSTANCE) == USART3_S)  || ((INSTANCE) == USART3_NS) || \
                                     ((INSTANCE) == USART6_S)  || ((INSTANCE) == USART6_NS) || \
                                     ((INSTANCE) == USART10_S) || ((INSTANCE) == USART10_NS))

/******************** UART Instances : Asynchronous mode *********************/
#define IS_UART_INSTANCE(INSTANCE) (((INSTANCE) == USART1_S)  || ((INSTANCE) == USART1_NS) || \
                                    ((INSTANCE) == USART2_S)  || ((INSTANCE) == USART2_NS) || \
                                    ((INSTANCE) == USART3_S)  || ((INSTANCE) == USART3_NS) || \
                                    ((INSTANCE) == UART4_S)   || ((INSTANCE) == UART4_NS)  || \
                                    ((INSTANCE) == UART5_S)   || ((INSTANCE) == UART5_NS)  || \
                                    ((INSTANCE) == USART6_S)  || ((INSTANCE) == USART6_NS) || \
                                    ((INSTANCE) == UART7_S)   || ((INSTANCE) == UART7_NS)  || \
                                    ((INSTANCE) == UART8_S)   || ((INSTANCE) == UART8_NS)  || \
                                    ((INSTANCE) == UART9_S)   || ((INSTANCE) == UART9_NS)  || \
                                    ((INSTANCE) == USART10_S) || ((INSTANCE) == USART10_NS))

/*********************** UART Instances : FIFO mode **************************/
#define IS_UART_FIFO_INSTANCE(INSTANCE) (((INSTANCE) == USART1_S)  || ((INSTANCE) == USART1_NS)  || \
                                         ((INSTANCE) == USART2_S)  || ((INSTANCE) == USART2_NS)  || \
                                         ((INSTANCE) == USART3_S)  || ((INSTANCE) == USART3_NS)  || \
                                         ((INSTANCE) == UART4_S)   || ((INSTANCE) == UART4_NS)   || \
                                         ((INSTANCE) == UART5_S)   || ((INSTANCE) == UART5_NS)   || \
                                         ((INSTANCE) == USART6_S)  || ((INSTANCE) == USART6_NS)  || \
                                         ((INSTANCE) == UART7_S)   || ((INSTANCE) == UART7_NS)   || \
                                         ((INSTANCE) == UART8_S)   || ((INSTANCE) == UART8_NS)   || \
                                         ((INSTANCE) == UART9_S)   || ((INSTANCE) == UART9_NS)   || \
                                         ((INSTANCE) == USART10_S) || ((INSTANCE) == USART10_NS) || \
                                         ((INSTANCE) == LPUART1_S) || ((INSTANCE) == LPUART1_NS))

/*********************** UART Instances : SPI Slave mode **********************/
#define IS_UART_SPI_SLAVE_INSTANCE(INSTANCE) (((INSTANCE) == USART1_S)  || ((INSTANCE) == USART1_NS)  || \
                                              ((INSTANCE) == USART2_S)  || ((INSTANCE) == USART2_NS)  || \
                                              ((INSTANCE) == USART3_S)  || ((INSTANCE) == USART3_NS)  || \
                                              ((INSTANCE) == USART6_S)  || ((INSTANCE) == USART6_NS)  || \
                                              ((INSTANCE) == USART10_S) || ((INSTANCE) == USART10_NS))

/****************** UART Instances : Auto Baud Rate detection ****************/
#define IS_USART_AUTOBAUDRATE_DETECTION_INSTANCE(INSTANCE) (((INSTANCE) == USART1_S)  || ((INSTANCE) == USART1_NS)  || \
                                                            ((INSTANCE) == USART2_S)  || ((INSTANCE) == USART2_NS)  || \
                                                            ((INSTANCE) == USART3_S)  || ((INSTANCE) == USART3_NS)  || \
                                                            ((INSTANCE) == UART4_S)   || ((INSTANCE) == UART4_NS)   || \
                                                            ((INSTANCE) == UART5_S)   || ((INSTANCE) == UART5_NS)   || \
                                                            ((INSTANCE) == USART6_S)  || ((INSTANCE) == USART6_NS)  || \
                                                            ((INSTANCE) == UART7_S)   || ((INSTANCE) == UART7_NS)   || \
                                                            ((INSTANCE) == UART8_S)   || ((INSTANCE) == UART8_NS)   || \
                                                            ((INSTANCE) == UART9_S)   || ((INSTANCE) == UART9_NS)   || \
                                                            ((INSTANCE) == USART10_S) || ((INSTANCE) == USART10_NS))

/****************** UART Instances : Driver Enable ***************************/
#define IS_UART_DRIVER_ENABLE_INSTANCE(INSTANCE) (((INSTANCE) == USART1_S)  || ((INSTANCE) == USART1_NS)  || \
                                                  ((INSTANCE) == USART2_S)  || ((INSTANCE) == USART2_NS)  || \
                                                  ((INSTANCE) == USART3_S)  || ((INSTANCE) == USART3_NS)  || \
                                                  ((INSTANCE) == UART4_S)   || ((INSTANCE) == UART4_NS)   || \
                                                  ((INSTANCE) == UART5_S)   || ((INSTANCE) == UART5_NS)   || \
                                                  ((INSTANCE) == USART6_S)  || ((INSTANCE) == USART6_NS)  || \
                                                  ((INSTANCE) == UART7_S)   || ((INSTANCE) == UART7_NS)   || \
                                                  ((INSTANCE) == UART8_S)   || ((INSTANCE) == UART8_NS)   || \
                                                  ((INSTANCE) == UART9_S)   || ((INSTANCE) == UART9_NS)   || \
                                                  ((INSTANCE) == USART10_S) || ((INSTANCE) == USART10_NS) || \
                                                  ((INSTANCE) == LPUART1_S) || ((INSTANCE) == LPUART1_NS))

/******************** UART Instances : Half-Duplex mode **********************/
#define IS_UART_HALFDUPLEX_INSTANCE(INSTANCE) (((INSTANCE) == USART1_S)  || ((INSTANCE) == USART1_NS)  || \
                                               ((INSTANCE) == USART2_S)  || ((INSTANCE) == USART2_NS)  || \
                                               ((INSTANCE) == USART3_S)  || ((INSTANCE) == USART3_NS)  || \
                                               ((INSTANCE) == UART4_S)   || ((INSTANCE) == UART4_NS)   || \
                                               ((INSTANCE) == UART5_S)   || ((INSTANCE) == UART5_NS)   || \
                                               ((INSTANCE) == USART6_S)  || ((INSTANCE) == USART6_NS)  || \
                                               ((INSTANCE) == UART7_S)   || ((INSTANCE) == UART7_NS)   || \
                                               ((INSTANCE) == UART8_S)   || ((INSTANCE) == UART8_NS)   || \
                                               ((INSTANCE) == UART9_S)   || ((INSTANCE) == UART9_NS)   || \
                                               ((INSTANCE) == USART10_S) || ((INSTANCE) == USART10_NS) || \
                                               ((INSTANCE) == LPUART1_S) || ((INSTANCE) == LPUART1_NS))

/****************** UART Instances : Hardware Flow control *******************/
#define IS_UART_HWFLOW_INSTANCE(INSTANCE) (((INSTANCE) == USART1_S)  || ((INSTANCE) == USART1_NS)  || \
                                           ((INSTANCE) == USART2_S)  || ((INSTANCE) == USART2_NS)  || \
                                           ((INSTANCE) == USART3_S)  || ((INSTANCE) == USART3_NS)  || \
                                           ((INSTANCE) == UART4_S)   || ((INSTANCE) == UART4_NS)   || \
                                           ((INSTANCE) == UART5_S)   || ((INSTANCE) == UART5_NS)   || \
                                           ((INSTANCE) == USART6_S)  || ((INSTANCE) == USART6_NS)  || \
                                           ((INSTANCE) == UART7_S)   || ((INSTANCE) == UART7_NS)   || \
                                           ((INSTANCE) == UART8_S)   || ((INSTANCE) == UART8_NS)   || \
                                           ((INSTANCE) == UART9_S)   || ((INSTANCE) == UART9_NS)   || \
                                           ((INSTANCE) == USART10_S) || ((INSTANCE) == USART10_NS) || \
                                           ((INSTANCE) == LPUART1_S) || ((INSTANCE) == LPUART1_NS))

/******************** UART Instances : LIN mode ******************************/
#define IS_UART_LIN_INSTANCE(INSTANCE) (((INSTANCE) == USART1_S)  || ((INSTANCE) == USART1_NS)  || \
                                        ((INSTANCE) == USART2_S)  || ((INSTANCE) == USART2_NS)  || \
                                        ((INSTANCE) == USART3_S)  || ((INSTANCE) == USART3_NS)  || \
                                        ((INSTANCE) == UART4_S)   || ((INSTANCE) == UART4_NS)   || \
                                        ((INSTANCE) == UART5_S)   || ((INSTANCE) == UART5_NS)   || \
                                        ((INSTANCE) == USART6_S)  || ((INSTANCE) == USART6_NS)  || \
                                        ((INSTANCE) == UART7_S)   || ((INSTANCE) == UART7_NS)   || \
                                        ((INSTANCE) == UART8_S)   || ((INSTANCE) == UART8_NS)   || \
                                        ((INSTANCE) == UART9_S)   || ((INSTANCE) == UART9_NS)   || \
                                        ((INSTANCE) == USART10_S) || ((INSTANCE) == USART10_NS))

/******************** UART Instances : Wake-up from Stop mode ****************/
#define IS_UART_WAKEUP_FROMSTOP_INSTANCE(INSTANCE) (((INSTANCE) == USART1_S)  || ((INSTANCE) == USART1_NS)  || \
                                                    ((INSTANCE) == USART2_S)  || ((INSTANCE) == USART2_NS)  || \
                                                    ((INSTANCE) == USART3_S)  || ((INSTANCE) == USART3_NS)  || \
                                                    ((INSTANCE) == UART4_S)   || ((INSTANCE) == UART4_NS)   || \
                                                    ((INSTANCE) == UART5_S)   || ((INSTANCE) == UART5_NS)   || \
                                                    ((INSTANCE) == USART6_S)  || ((INSTANCE) == USART6_NS)  || \
                                                    ((INSTANCE) == UART7_S)   || ((INSTANCE) == UART7_NS)   || \
                                                    ((INSTANCE) == UART8_S)   || ((INSTANCE) == UART8_NS)   || \
                                                    ((INSTANCE) == UART9_S)   || ((INSTANCE) == UART9_NS)   || \
                                                    ((INSTANCE) == USART10_S) || ((INSTANCE) == USART10_NS) || \
                                                    ((INSTANCE) == LPUART1_S) || ((INSTANCE) == LPUART1_NS))

/*********************** UART Instances : IRDA mode **************************/
#define IS_IRDA_INSTANCE(INSTANCE) (((INSTANCE) == USART1_S)  || ((INSTANCE) == USART1_NS)  || \
                                    ((INSTANCE) == USART2_S)  || ((INSTANCE) == USART2_NS)  || \
                                    ((INSTANCE) == USART3_S)  || ((INSTANCE) == USART3_NS)  || \
                                    ((INSTANCE) == UART4_S)   || ((INSTANCE) == UART4_NS)   || \
                                    ((INSTANCE) == UART5_S)   || ((INSTANCE) == UART5_NS)   || \
                                    ((INSTANCE) == USART6_S)  || ((INSTANCE) == USART6_NS)  || \
                                    ((INSTANCE) == UART7_S)   || ((INSTANCE) == UART7_NS)   || \
                                    ((INSTANCE) == UART8_S)   || ((INSTANCE) == UART8_NS)   || \
                                    ((INSTANCE) == UART9_S)   || ((INSTANCE) == UART9_NS)   || \
                                    ((INSTANCE) == USART10_S) || ((INSTANCE) == USART10_NS))

