micropython/micropython/lib/stm32n6/CMSIS/STM32N6xx/Include/stm32n655xx.h
/*********************** UART Instances : SPI Slave mode **********************/
#define IS_UART_SPI_SLAVE_INSTANCE(INSTANCE) (((INSTANCE) == USART1_NS)  || \
                                              ((INSTANCE) == USART2_NS)  || \
                                              ((INSTANCE) == USART3_NS)  || \
                                              ((INSTANCE) == USART6_NS)  || \
                                              ((INSTANCE) == USART10_NS))

/****************** UART Instances : Auto Baud Rate detection ****************/
#define IS_USART_AUTOBAUDRATE_DETECTION_INSTANCE(INSTANCE) (((INSTANCE) == USART1_NS)  || \
                                                            ((INSTANCE) == USART2_NS)  || \
                                                            ((INSTANCE) == USART3_NS)  || \
                                                            ((INSTANCE) == UART4_NS)   || \
                                                            ((INSTANCE) == UART5_NS)   || \
                                                            ((INSTANCE) == USART6_NS)  || \
                                                            ((INSTANCE) == UART7_NS)   || \
                                                            ((INSTANCE) == UART8_NS)   || \
                                                            ((INSTANCE) == UART9_NS)   || \
                                                            ((INSTANCE) == USART10_NS))

/****************** UART Instances : Driver Enable ***************************/
#define IS_UART_DRIVER_ENABLE_INSTANCE(INSTANCE) (((INSTANCE) == USART1_NS)  || \
                                                  ((INSTANCE) == USART2_NS)  || \
                                                  ((INSTANCE) == USART3_NS)  || \
                                                  ((INSTANCE) == UART4_NS)   || \
                                                  ((INSTANCE) == UART5_NS)   || \
                                                  ((INSTANCE) == USART6_NS)  || \
                                                  ((INSTANCE) == UART7_NS)   || \
                                                  ((INSTANCE) == UART8_NS)   || \
                                                  ((INSTANCE) == UART9_NS)   || \
                                                  ((INSTANCE) == USART10_NS) || \
                                                  ((INSTANCE) == LPUART1_NS))

/******************** UART Instances : Half-Duplex mode **********************/
#define IS_UART_HALFDUPLEX_INSTANCE(INSTANCE) (((INSTANCE) == USART1_NS)  || \
                                               ((INSTANCE) == USART2_NS)  || \
                                               ((INSTANCE) == USART3_NS)  || \
                                               ((INSTANCE) == UART4_NS)   || \
                                               ((INSTANCE) == UART5_NS)   || \
                                               ((INSTANCE) == USART6_NS)  || \
                                               ((INSTANCE) == UART7_NS)   || \
                                               ((INSTANCE) == UART8_NS)   || \
                                               ((INSTANCE) == UART9_NS)   || \
                                               ((INSTANCE) == USART10_NS) || \
                                               ((INSTANCE) == LPUART1_NS))

/****************** UART Instances : Hardware Flow control *******************/
#define IS_UART_HWFLOW_INSTANCE(INSTANCE) (((INSTANCE) == USART1_NS)  || \
                                           ((INSTANCE) == USART2_NS)  || \
                                           ((INSTANCE) == USART3_NS)  || \
                                           ((INSTANCE) == UART4_NS)   || \
                                           ((INSTANCE) == UART5_NS)   || \
                                           ((INSTANCE) == USART6_NS)  || \
                                           ((INSTANCE) == UART7_NS)   || \
                                           ((INSTANCE) == UART8_NS)   || \
                                           ((INSTANCE) == UART9_NS)   || \
                                           ((INSTANCE) == USART10_NS) || \
                                           ((INSTANCE) == LPUART1_NS))

/******************** UART Instances : LIN mode ******************************/
#define IS_UART_LIN_INSTANCE(INSTANCE) (((INSTANCE) == USART1_NS) || \
                                        ((INSTANCE) == USART2_NS)  || \
                                        ((INSTANCE) == USART3_NS)  || \
                                        ((INSTANCE) == UART4_NS)   || \
                                        ((INSTANCE) == UART5_NS)   || \
                                        ((INSTANCE) == USART6_NS)  || \
                                        ((INSTANCE) == UART7_NS)   || \
                                        ((INSTANCE) == UART8_NS)   || \
                                        ((INSTANCE) == UART9_NS)   || \
                                        ((INSTANCE) == USART10_NS))

/******************** UART Instances : Wake-up from Stop mode ****************/
#define IS_UART_WAKEUP_FROMSTOP_INSTANCE(INSTANCE) (((INSTANCE) == USART1_NS)  || \
                                                    ((INSTANCE) == USART2_NS)  || \
                                                    ((INSTANCE) == USART3_NS)  || \
                                                    ((INSTANCE) == UART4_NS)   || \
                                                    ((INSTANCE) == UART5_NS)   || \
                                                    ((INSTANCE) == USART6_NS)  || \
                                                    ((INSTANCE) == UART7_NS)   || \
                                                    ((INSTANCE) == UART8_NS)   || \
                                                    ((INSTANCE) == UART9_NS)   || \
                                                    ((INSTANCE) == USART10_NS) || \
                                                    ((INSTANCE) == LPUART1_NS))

/*********************** UART Instances : IRDA mode **************************/
#define IS_IRDA_INSTANCE(INSTANCE) (((INSTANCE) == USART1_NS)  || \
                                    ((INSTANCE) == USART2_NS)  || \
                                    ((INSTANCE) == USART3_NS)  || \
                                    ((INSTANCE) == UART4_NS)   || \
                                    ((INSTANCE) == UART5_NS)   || \
                                    ((INSTANCE) == USART6_NS)  || \
                                    ((INSTANCE) == UART7_NS)   || \
                                    ((INSTANCE) == UART8_NS)   || \
                                    ((INSTANCE) == UART9_NS)   || \
                                    ((INSTANCE) == USART10_NS))

